{
    "42688608239803": {
        "id": "42688608239803",
        "name": "Assorted Fruit Sours Candy Balls - 5lb",
        "prod_url": "https://www.candystore.com/products/fruit-sours-candy-balls-assorted",
        "img_url": "https://www.candystore.com/cdn/shop/products/Assorted-Fruit-Sours-Candy-Balls-5lb-CandyStore-com-271_2048x.jpg?v=1677660478",
        "price": 37.99,
        "desc": "Holy Moly! These tart Assorted Fruit Sours Candies deliver an unrelenting pucker with delicious, fruity flavor. In sour apple, lemon, tangerine, grape, and cherry, there's a flavor for everyone. Bring some to a birthday party, add some to a lemonade for a sour, fruity flavor addition and pretty garnish, or keep them around the house when you're in the mood for a feisty snack. One of the sourest candies to grace the mouths of many, these little pucker-packed candies will please every sour candy lover. Their rainbow of beautiful, bright colors may look unsuspecting, but get ready for a dose of tartness that will thrill your taste buds!"
    },
    "42688609288379": {
        "id": "42688609288379",
        "name": "Red Cherry Fruit Sours Candy Balls - 5lb",
        "prod_url": "https://www.candystore.com/products/red-cherry-fruit-sours-candy-balls",
        "img_url": "https://www.candystore.com/cdn/shop/products/Red-Cherry-Fruit-Sours-Candy-Balls-5lb-CandyStore-com-997_2048x.jpg?v=1677170381",
        "price": 37.99,
        "desc": "Red cherry fruit sours candy is a great addition to any holiday spread. Let's face it; red goes with almost any occasion. It's the perfect color addition to Valentine's Day, Christmas, the Fourth of July, and it even works for a  bloody  element to Halloween. Red cherry fruit sours explode in your mouth with tartness and sweetness. These delicious candies are sure to be a hit with all your sour-loving friends at your next party. "
    },
    "42689223033019": {
        "id": "42689223033019",
        "name": "Bulk M&M's Candy - 10lb Individual Colors",
        "prod_url": "https://www.candystore.com/products/mms-individual-colors",
        "img_url": "https://www.candystore.com/cdn/shop/products/Bulk-M-M-s-Candy-10lb-Individual-Colors-CandyStore-com-279_2048x.jpg?v=1677666773",
        "price": 145.99,
        "desc": " It's undeniable that M&M's Candy is a household name, but the story behind its moniker is a nugget of sweet history. Named for the partnership of Forest Mars and Bruce Murrie in 1941, this candy is not just an edible delight, but a legacy. These pioneers brought us the melty, milk chocolate bliss encased in a colorful shell that has captured hearts around the world and remains a top pick in candy stores everywhere.\nThe joy that M&M's bring isn’t just in their taste but also in their vibrant spectrum. With hues spanning from the bluest skies to sunniest yellows and the deepest reds, these candies brighten any occasion. A bulk candy buy of M&M's is not just a purchase; it's an investment in a kaleidoscope of joy that can be savored in every tiny, chocolatey piece.\nWhen you visit your local candy store, the sight of bulk M&M's candies inspires more than just snacking. These colorful morsels are a baker's best friend, adding a pop of color and a rich, chocolatey taste to all sorts of baked goods. Imagine the smiles when you unveil a cake dotted with these iconic candies or cookies that reveal a chocolate surprise with every bite.\nBut the fun doesn’t stop there. The bulk M&M's experience is perfect for crafting personalized goodie bags for parties, creating vibrant candy tables, or filling pinatas to the brim for a shower of color and sweetness. In a candy store, M&M's in bulk are the go-to for any creative candy endeavor, from decorating to gifting, ensuring that your pantry is always stocked with a taste of happiness."
    },
    "42709387903163": {
        "id": "42709387903163",
        "name": "Jelly Belly Jelly Beans - 10lb",
        "prod_url": "https://www.candystore.com/products/jelly-belly-jelly-beans",
        "img_url": "https://www.candystore.com/cdn/shop/products/Jelly-Belly-Jelly-Beans-10lb-CandyStore-com-131_2048x.jpg?v=1677148077",
        "price": 86.99,
        "desc": "Indulge in the gourmet taste of Jelly Belly Jelly Beans, the candy that has become a classic treat across the nation. Now, your favorite candy store offers the excitement and joy of these tiny confections in a generous 10lb bulk candy pack. Each bean bursts with flavors so authentic, you'll feel like you're enjoying the real thing—whether it's juicy pear, luscious cherry, or any of the multitude of enticing options Jelly Belly is famed for.\nJelly Belly's dedication to quality and flavor variety transforms every moment into a taste adventure. When you purchase from a candy store that offers bulk candy, you're not just getting a snack; you're embarking on a flavor journey that spans the classic, the fruity, the spicy, and the absolutely unexpected. The 10lb bulk offering allows candy lovers to get their hands on a vast array of choices to suit any palate or occasion.\nAre you planning a large event or crafting the perfect candy buffet? Look no further than the vibrant variety of Jelly Belly Jelly Beans available in bulk. Your local candy store provides this ample quantity, ideal for weddings, corporate events, or for the true jelly bean aficionado who understands the joy of having a personal stash of these premium candies.\nFrom the moment you open the bag and the sweet aroma greets your senses, to the last bean you savor, Jelly Belly Jelly Beans in bulk are an experience. These beans aren’t just candy; they’re a versatile classic. Use them in your baking endeavors to add a pop of color and taste, or get creative with Jelly Belly-themed arts and crafts. Your bulk candy purchase is more than just a treat—it's a spark of creativity.\nTrue enthusiasts know that Jelly Belly Jelly Beans are not your average sweet. They're a gourmet delicacy crafted with care and precision. A bulk candy buy ensures that you have a diverse mix of Jelly Belly's 50 official flavors, allowing you to enjoy the flavors of the world one bean at a time. Whether it's the smooth creaminess of vanilla, the tang of green apple, or the tropical zing of mango, each Jelly Belly Jelly Bean is a microcosm of flavor waiting to explode in your mouth.\nWhen you choose to purchase Jelly Belly Jelly Beans in bulk from a respected candy store, you're not only getting a deal in quantity but also in taste. The 10lb package ensures that your pantry is always stocked for a sweet snack, a creative dessert garnish, or a colorful addition to party favors. Take advantage of the wide array of Jelly Belly Jelly Bean flavors that bulk candy offers and never run out of your favorite treat again."
    },
    "42688627867835": {
        "id": "42688627867835",
        "name": "Runts Candy - 10lb",
        "prod_url": "https://www.candystore.com/products/runts-bulk",
        "img_url": "https://www.candystore.com/cdn/shop/products/Runts-Candy-10lb-CandyStore-com-844_2048x.jpg?v=1677173064",
        "price": 68.99,
        "desc": "Runts candy made its first appearance in the 1980s. While its fruity lineup has changed since then, its popularity has not. Every kid can recognize the fun shapes and bright colors that make Runts so unique. Our extensive collection of bulk candy includes this childhood favorite so you can get your fill of sweet fruity goodness anytime you want! Serve at kid's parties, take as a non-perishable snack on camping trips or set some aside to hide away at home for moments when you need a sweet fix!Our Runts candy package include all the current flavors and shapes. You'll love biting down on a yellow banana or savoring a tart cherry piece. Each order also includes blue raspberry, watermelon and lime. Try the smooth, sweet taste of your favorite fruits followed by the tantalizing tanginess that makes Runts candies so delectable. You don't have to go to a vending machine to find your favorite treat because we have Runts in bulk and ready to ship right to you!"
    },
    "42688417038523": {
        "id": "42688417038523",
        "name": "Reese's Pieces Candy - 6.25lb",
        "prod_url": "https://www.candystore.com/products/reeses-pieces-candy-bulk",
        "img_url": "https://www.candystore.com/cdn/shop/products/Reese-s-Pieces-Candy-6-25lb-CandyStore-com-894_2048x.jpg?v=1677171299",
        "price": 54.99,
        "desc": "Relish creamy peanut butter and a hard candy shell with every bite of Reese's Pieces candies! These classic confections are completely irresistible! Each package includes the classic orange, yellow and brown treats that are shaped like M&Ms but offer a completely unique peanut buttery flavor. When a whole peanut butter cup is just too much, grab a handful or our delicious Reese's Pieces!Any kid who was around during the 1980s will fondly recall this tasty treat. It was flying off the shelves after making an appearance in Steven Spielberg's classic film, E. T. the Extra-Terrestrial. Reese's Pieces candy has changed very little since then. Each bite still offers the same irresistible flavor and crunch that kids were loving over 30 years ago. Now you can enjoy this brand name favorite at parties, picnics, events or at home. Our bulk candy package contains more than enough Reese's Pieces candy to please a crowd!"
    },
    "42688600211643": {
        "id": "42688600211643",
        "name": "Micro Jawbreakers - Assorted - 10lb",
        "prod_url": "https://www.candystore.com/products/micro-jawbreakers-assorted",
        "img_url": "https://www.candystore.com/cdn/shop/products/Micro-Jawbreakers-Assorted-10lb-CandyStore-com-61_2048x.jpg?v=1677158092",
        "price": 58.99,
        "desc": "Micro jawbreakers take the irresistible taste of big jawbreakers and packs it all into a compact treat. Children have savored the sweet flavors of this popular candy for years. Simply pop one in your mouth and let your taste buds experience an assortment of fruity flavors. Micro jawbreakers may not be as big, but these quarter-inch tidbits still pack powerful flavor! They are perfect for a quick treat that doesn't require hours of licking. Our bulk jawbreaker package includes a generous quantity of vibrantly colored pieces. Try your luck with red, green, yellow, orange or blue! The rainbow jawbreaker assortment is wonderful for birthday parties with colorful decor!You can also pour a handful into a treat bag to give as party favors or to pass out on Halloween. Our bulk candy package will give you plenty of miniature jawbreakers to go around √ê even if you're hosting an event with a large group!"
    },
    "42688602833083": {
        "id": "42688602833083",
        "name": "Boston Baked Beans Candy - 5lb",
        "prod_url": "https://www.candystore.com/products/boston-baked-beans",
        "img_url": "https://www.candystore.com/cdn/shop/products/Boston-Baked-Beans-Candy-5lb-CandyStore-com-743_2048x.jpg?v=1677665786",
        "price": 32.99,
        "desc": "At first look, a person may wonder how beans are candy but don't worry Boston Baked Beans aren't really beans at all. They get their name because of their unique shape but they are all candy and delightfully delicious. These candy covered peanuts have been associated with the great city of Boston since they were first introduced many years ago. They are red in color but the greatest thing about these treats is that they provide a crunchy delicious flavor to any occasion. The traditions Boston Baked Beans were always red, but in these modern times you can get these treats in a rainbow of colors - thought that option is temporarily unavailable. That means that you can find green ones for St. Patrick's Day or orange ones for Halloween. The Boston Baked Bean has been a very popular candy for over a hundred years and that is because all people love nuts covered in a candy coating."
    },
    "42688631111867": {
        "id": "42688631111867",
        "name": "Skittles Candy - 50oz Bags",
        "prod_url": "https://www.candystore.com/products/skittles-41oz",
        "img_url": "https://www.candystore.com/cdn/shop/products/Skittles-Party-Size-Bag-50oz-CandyStore-com-467_2048x.jpg?v=1677174471",
        "price": 22.99,
        "desc": "We get it. You like to ''Taste the Rainbow'' A LOT. Never fear, this jumbo bag of Skittles is here to provide you with countless hours and mouthfuls of fruity escape. With a colorful selection of juicy flavors, you can pack these fruity morsels into a pinata, add them to a stocking, or slip one into your kid's lunchbox for a delicious afternoon surprise. Skittles have been in the US since 1979 and have evolved into a quirky brand and a household name. Their original flavors of orange, lemon, lime, grape and strawberry got a revamp in 1989 with the introduction of tropical fruit flavors. Since then, 1 new Skittles lines have been created and amazed the mouths of people all over the world."
    },
    "42688384172219": {
        "id": "42688384172219",
        "name": "Flower Power Garden Mix Candy - 10lb",
        "prod_url": "https://www.candystore.com/products/flower-power-sweet-tarts-case",
        "img_url": "https://www.candystore.com/cdn/shop/products/Flower-Power-Garden-Mix-Candy-10lb-CandyStore-com-546_2048x.jpg?v=1677135867",
        "price": 52.99,
        "desc": "Flower Power sweet tarts take a classic candy and make it beautiful! Each piece combines a sweet and tart taste with a pressed texture. Our colorful assortment features a number of vibrant hues, including bubblegum pink, energetic orange and sunshine yellow. Every piece is shaped into a classic flower pattern, with a round center and six petals with curved tips. Our bulk Flower Power sweet tarts are a wonderful choice for girls' birthday parties and other events. Pour in bowls to serve guests or use to fill up treat bags at princess parties. They also make a tasty addition to candy buffets. Use them to decorate cakes or cupcakes. This unique sweet tart candy features a shape that's playful enough for children's events but eye-catching enough to look gorgeous in weddings and baby showers. Treat guests to the nostalgic taste of sweet tarts with a floral twist by serving our Flower Power sweet tart candy!"
    },
    "42688436764859": {
        "id": "42688436764859",
        "name": "Green Apple Fruit Sours Candy Balls - 5lb",
        "prod_url": "https://www.candystore.com/products/green-apple-fruit-sours-candy-balls",
        "img_url": "https://www.candystore.com/cdn/shop/products/Green-Apple-Fruit-Sours-Candy-Balls-5lb-CandyStore-com-17_2048x.jpg?v=1677141374",
        "price": 37.99,
        "desc": "An apple a day may keep the doctor away. But a Green Apple Fruit Sours Candy Ball can keep you smiling all day! These delicious green apple sour candies are a delicious treat for any day of the week. Coated in a bright green candy shell and packed with a soft chewy candy center, every sour snacker will love these. Use them for a spring or summer themed event. Add them to a gingerbread house for an atypical flavor that still has the holiday green you love. Or even bring some to a birthday party for someone who loves sour candy and the color green! We're sure you'll feel better once you try these. "
    },
    "42688609943739": {
        "id": "42688609943739",
        "name": "Yellow Lemon Fruit Sours Candy Balls - 5lb",
        "prod_url": "https://www.candystore.com/products/yellow-lemon-fruit-sours-candy-balls",
        "img_url": "https://www.candystore.com/cdn/shop/products/Yellow-Lemon-Fruit-Sours-Candy-Balls-5lb-CandyStore-com-516_2048x.jpg?v=1677186549",
        "price": 37.99,
        "desc": "When life gives you lemons, what do you do? Make lemon fruit sour candies, duh! They're the perfect combination of citrusy tang and soft, chewy texture. And with a not too sour, not too sweet taste, they're a crowd pleaser for every member of your family. Use them for a yellow-themed event, the Easter holiday, a bright colored estimation jar, or even enjoy them on display in a beautiful glass vase. These candies are sure to take you back to the lemonade stands of your youth. And the best part is, you can feel like you're sipping fresh, homemade lemonade any month of the year. "
    },
    "42688610205883": {
        "id": "42688610205883",
        "name": "Wild Berry Fruit Sours Candy - 5lb",
        "prod_url": "https://www.candystore.com/products/blue-raspberry-fruit-sours-candy",
        "img_url": "https://www.candystore.com/cdn/shop/products/Wild-Berry-Fruit-Sours-Candy-5lb-CandyStore-com-200_2048x.jpg?v=1677185975",
        "price": 37.99,
        "desc": "Are you someone who wants to have the best of both worlds? Well, you're in luck! With these soft, chewy candies, you will have the pleasant sugary taste of sweet blue raspberry complemented by a sour salute of citrus. Give them a try for a Hanukkah party or blue themed get together. Or even buy them as a gift for a friend who loves to pucker up with a sweet and sour bite. For every occasion, these blue raspberry candies have proven to be a popular choice. And we're sure a handful of these will please a crowd in your life. "
    },
    "42726928842939": {
        "id": "42726928842939",
        "name": "White M&Ms Candy - 10lb",
        "prod_url": "https://www.candystore.com/products/white-mms",
        "img_url": "https://www.candystore.com/cdn/shop/products/White-M-Ms-Candy-10lb-CandyStore-com-134_2048x.jpg?v=1677185662",
        "price": 136.99,
        "desc": "This little confection is the proud winner of the candy color popularity contest time after time. That's because these irresistible White M&Ms match most occasions and have the rich, melty milk chocolatey taste that candy is famous for. Bring some to a wedding, add a few to a candy buffet bar to match any color scheme, or even use them in baking for a bright white look. Since 1941, M&Ms button-sized shape, hard candy crunch, and milk chocolate meltiness have been pleasing palates near and far. See for yourself why these ''melt in your mouth, not in your hand'' classics have made their way into America's hearts and stomachs."
    },
    "42688608927931": {
        "id": "42688608927931",
        "name": "Orange Tangerine Fruit Sours Candy Balls - 5lb",
        "prod_url": "https://www.candystore.com/products/orange-tangerine-fruit-sours-candy-balls",
        "img_url": "https://www.candystore.com/cdn/shop/products/Orange-Tangerine-Fruit-Sours-Candy-Balls-5lb-CandyStore-com-465_2048x.jpg?v=1677162689",
        "price": 37.99,
        "desc": "Pucker up, buttercup! These Orange Tangerine Fruit Sours Candy have a mighty mix of sour and sweet to delight the mouths of many. Soft, chewy, tangy, and gorgeous, the bright mix of candy balls is a cheerful dose of sugar and citrus. Use them for an autumn inspired gift basket, on the Thanksgiving dessert table, or even as sour additions to a trick-or-treat stash. They can even make a summertime festival even more special by adding the beautiful color of the hot sun. There is no wrong way for your friends and family to enjoy these fruity, delicious and sour candies. "
    },
    "42688609124539": {
        "id": "42688609124539",
        "name": "Green Watermelon Fruit Sours Candy Balls - 5lb",
        "prod_url": "https://www.candystore.com/products/pink-watermelon-fruit-sours-candy-balls",
        "img_url": "https://www.candystore.com/cdn/shop/products/Green-Watermelon-Fruit-Sours-Candy-Balls-5lb-CandyStore-com-177_2048x.png?v=1677141669",
        "price": 37.99,
        "desc": "We think these candies are ''de-vine. '' A real knee-slapper we know, but in all seriousness, these Pink Watermelon Fruit Sours Candies taste like they're fresh off the vine. Covered in a beautiful, glossy pink shell and complete with a soft, fruity chew, these candies are cultivated by using some of the sweetest techniques in the candy biz. Use some for a light sweet at a backyard picnic, bring some to a gathering of friends, even use them for a lovely addition to an outdoor wedding. For watermelon and candy enthusiasts, alike, this bag will provide you with hours and hours of happy snacking. "
    },
    "42689204322491": {
        "id": "42689204322491",
        "name": "Jordan Almonds White & Pastel - 7lb Bulk",
        "prod_url": "https://www.candystore.com/products/sconza-jordan-almonds-bulk",
        "img_url": "https://www.candystore.com/cdn/shop/products/Jordan-Almonds-White-Pastel-7lb-Bulk-CandyStore-com-978_2048x.jpg?v=1677149786",
        "price": 51.99,
        "desc": "Jordan almonds are a must-have favorite at weddings, showers and other important occasions. This classic confection is sometimes called a sugar almond because it consists of an almond which is sugar panned to create a delicious coating and pastel colors. While the Jordan almond may be a popular modern candy, its roots are believed to date as far back as Ancient Rome, where almonds were covered in honey and eaten during festivals. Our delicate Jordan almonds offer the delightful crunch and sweet candy coating in an assortment of gentle colors. You'll love grabbing a handful to find lavender, pink, white and minty green. Along with shower and wedding favors, our Jordan almonds are also ideal for serving at spring and Easter events. Guests will love the rich flavor and delectable crispness that comes with every bite. Our bulk Jordan almonds offer consistent quality in a candy you'll love to share!"
    },
    "42688681246907": {
        "id": "42688681246907",
        "name": "Skittles Candy - 36ct",
        "prod_url": "https://www.candystore.com/products/skittles-packs",
        "img_url": "https://www.candystore.com/cdn/shop/products/Skittles-Candy-36ct-CandyStore-com-983_2048x.jpg?v=1677174530",
        "price": 75.99,
        "desc": "A color and flavor for every taste bud. This famous 'Taste the Rainbow' candy is a crowd pleaser. Add them to your household candy dishes, put some out in a candy bar buffet, or even stick some in your kids' lunchboxes for a fruity surprise. Skittles have been in the US since 1979 and have evolved into a quirky brand and a household name. Their original flavors of orange, lemon, lime, grape and strawberry got a revamp in 1989 with the introduction of tropical fruit flavors. Since then, 10 new Skittles lines have been created and amazed the mouths of people all over the world."
    },
    "42688437092539": {
        "id": "42688437092539",
        "name": "Purple Grape Fruit Sours Candy Balls - 5lb",
        "prod_url": "https://www.candystore.com/products/purple-grape-fruit-sours-candy-balls",
        "img_url": "https://www.candystore.com/cdn/shop/products/Purple-Grape-Fruit-Sours-Candy-Balls-5lb-CandyStore-com-848_2048x.jpg?v=1677168970",
        "price": 37.99,
        "desc": "Wooooweee! These tart purple candies deliver an unrelenting pucker with delicious, fruity flavor. If you like a sour shot to the mouth, try our Purple Grape Fruit Sours Candy. The sourest candy on the vine, these little pucker-packed candies will please every sour lover. Bring some to a purple themed party, add some to a lemonade for a sour grape flavor addition and pretty garnish, or keep them around the house when you're in the mood for a feisty snack. Their deep, purple coloring may look unsuspecting, but get ready for a dose of tartness that will thrill your taste buds!"
    },
    "42727131381947": {
        "id": "42727131381947",
        "name": "White Jordan Almonds -7lb Bulk",
        "prod_url": "https://www.candystore.com/products/white-jordan-almonds-sconza",
        "img_url": "https://www.candystore.com/cdn/shop/products/White-Jordan-Almonds-7lb-Bulk-CandyStore-com-467_2048x.jpg?v=1677185703",
        "price": 59.99,
        "desc": "White Jordan almonds are a must-have favorite at Easter and also at Springtime weddings, showers and other important occasions. A delightful crunch and sweet candy coating in an assortment of gentle colors."
    },
    "42726923960507": {
        "id": "42726923960507",
        "name": "Dark Blue M&Ms Candy - 10lb",
        "prod_url": "https://www.candystore.com/products/dark-blue-mms",
        "img_url": "https://www.candystore.com/cdn/shop/products/Dark-Blue-M-Ms-Candy-10lb-CandyStore-com-46_2048x.jpg?v=1677132728",
        "price": 136.99,
        "desc": "Our dark blue M&Ms make it easy to customize your candy selection so it matches the style of your event! We carry a number of classic colors that are available in a bulk candy package. Our dark blue M&Ms present a unique hue that you won't find in the typical store bought bag. Each piece is covered in a hard candy shell that presents a navy hue stamped with the candy's unmistakable letter logo.Each navy M&M features the same smooth chocolate center that has made this treat so popular. Order a bag so you always have your favorite color on hand to enjoy at home. Our dark blue version is also great for use in baby shower and wedding favors or can be served as part of an event. For even more festive fun, try combining two or three bags of our bulk M&Ms so you can set out candy bowls that alternate between colors!"
    }
}