{"42688393183419": {"id": "42688393183419", "name": "Caramel Candy Squares - 5lb", "prod_url": "https://www.candystore.com/products/caramel-squares-wrapped", "img_url": "https://www.candystore.com/cdn/shop/products/Caramel-Candy-Squares-5lb-CandyStore-com-43_2048x.jpg?v=1677668249", "price": 27.99, "desc": "Don't be such a square! Unless you want to be a delicious, creamy Caramel Square. These tawny, creamy cubes are amazing little morsels that will melt away in your mouth and leave a smile on your face. Individually wrapped in clear cellophane, they make a great addition to a candy buffet bar, as a candy dish go-to, or even to keep around the house and melt into hot chocolate and baked goods. Caramel has been around for centuries and transforms typical granulated sugar into this famous form of ooey, gooey chewiness when heated at a high heat. We'd like give the culinary geniuses who came up with this fantastic candy a pat on the back!"}, "42688573341883": {"id": "42688573341883", "name": "Chocolate Caramel Squares Candy - 5lb Bulk", "prod_url": "https://www.candystore.com/products/chocolate-caramel-squares", "img_url": "https://www.candystore.com/cdn/shop/products/Chocolate-Caramel-Squares-Candy-5lb-Bulk-CandyStore-com-250_2048x.jpg?v=1677670342", "price": 36.99, "desc": "We love that these Chocolate Caramel Squares Candies come wrapped in cellophane so we can see right through to the deliciousness! And why would anyone want to cover up a candy that features a delicious milk chocolate square of amazingness and a melty, chewy caramel center inside?Are you a major proponent for Chocolate Caramel Square Candies? Then you've hit the jackpot here on CandyStore. com because we have tehm in bulk at budget friendly prices. This means you can bring home hundreds of these Chocolate Caramel Square Candies to chow down on for weeks to come. Or however long your sweet tooth allows."}, "42688668008635": {"id": "42688668008635", "name": "Goetze's Caramel Creams Bulls Eyes - 10lb", "prod_url": "https://www.candystore.com/products/bulls-eyes-caramel-creams", "img_url": "https://www.candystore.com/cdn/shop/products/Goetze-s-Caramel-Creams-Bulls-Eyes-10lb-CandyStore-com-939_2048x.jpg?v=1677139916", "price": 46.99, "desc": "Each Caramel Cream (or Bull's Eye), starts with a white cream filling at the center. The outside includes a generous layer of high quality caramel to create a round treat. Our bulk Caramel Creams arrive individually wrapped with nostalgic red Goetze branding. Caramel Cream Bulls Eyes are the crowning jewel in the Goetze's catalog. The Goetze brand goes way back to 1895. By 1917, the family-owned company introduced its first soft caramel candies, much to the delight of candy lovers!Today, Caramel Creams are considered Goetze's signature creation, and it's easy to see why once you sink your teeth into one! Keep them in the candy jar at home, take them to the office to share or add to a gourmet gift basket! Caramel Creams are also a wonderful choice for shower and wedding favors. Their sweet, creamy taste and classic look appeals to candy lovers of all ages! Find out what makes Goetze so delicious by adding Caramel Creams to your next gathering. "}, "42688616104123": {"id": "42688616104123", "name": "Caramel Apple Pops - 48ct", "prod_url": "https://www.candystore.com/products/caramel-apple-pops", "img_url": "https://www.candystore.com/cdn/shop/products/Caramel-Apple-Pops-48ct-CandyStore-com-987_2048x.jpg?v=1677668259", "price": 22.99, "desc": "Enjoy the bounty of the autumn harvest without setting foot in an orchard. A play on a classic fall favorite, these classic green apple lollies are slathered in a creamy, chewy, caramel coating that has been greedily gobbled up for years. Bring them to a fall party, use them as Halloween treats, or remind yourself of autumn any time of the year. Every snacker will feel like you're on a tractor ride, traversing a corn maze, and smelling fresh bales of hay every time you eat one of these. And the best part is, these tart treats are here all year 'round."}, "42726975766715": {"id": "42726975766715", "name": "Caramel Apple Salt Water Taffy - 2.5lb", "prod_url": "https://www.candystore.com/products/caramel-apple-salt-water-taffy", "img_url": "https://www.candystore.com/cdn/shop/products/Caramel-Apple-Salt-Water-Taffy-2-5lb-CandyStore-com-950_2048x.png?v=1677668338", "price": 15.99, "desc": "One classic confection with the flavor of another: it is a novelty with the appeal of a tradition! Caramel Apple Salt Water Taffy has a bright green center that looks bright as springtime when you use it as a table scatter or to fill an heirloom dish.A symbol of playful days and sunny summers by the sea, bulk saltwater taffy is beloved by kids and adults for its soft, chewy, flavorful composition, and the individual wrappers on these green and brown taffy delicacies make them perfect for candy buffets, treat bags, and pantry stockpiles of tasty sweets.The tart green apple flavor in this wholesale caramel apple taffy combines with a creamy, sweet caramel taste that is reminiscent of the original molasses recipe from which modern taffy flavors evolved. Apple flavor, too, takes your taste buds straight to the autumn orchards, too. The combination of classic taste appeals makes caramel apple saltwater taffy an especially evocative little treat!"}, "42689677689019": {"id": "42689677689019", "name": "Milk Chocolate Duds Candy - 10lb", "prod_url": "https://www.candystore.com/products/milk-chocolate-duds", "img_url": "https://www.candystore.com/cdn/shop/products/milk-chocolate-duds-1q23-wmark_2048x.jpg?v=1677494949", "price": 88.99, "desc": "Milk Chocolate Duds - 10lb"}, "42689672904891": {"id": "42689672904891", "name": "Matlow Assorted Crystal Fruit Hard Candy - 5.75lb Bulk", "prod_url": "https://www.candystore.com/products/matlow-crystal-fruit", "img_url": "https://www.candystore.com/cdn/shop/products/Matlow-Crystal-Fruit-5-75lb-CandyStore-com-615_2048x.jpg?v=1677157701", "price": 49.99, "desc": "Matlow Crystal Fruit - 5.75lb"}, "42688398360763": {"id": "42688398360763", "name": "Licorice Caramels - 4.4lb", "prod_url": "https://www.candystore.com/products/licorice-caramels", "img_url": "https://www.candystore.com/cdn/shop/products/Licorice-Caramels-4-4lb-CandyStore-com-988_2048x.jpg?v=1677153195", "price": 52.99, "desc": "The mad scientists of the candy world have created a magical hybrid of flavors! We're talking about our licorice caramels and can't wait for you to bring some home and take a bite. In a dark chocolatey brown, these cellophane wrapped black caramels have the delicious creaminess of caramel and the bite of licorice so the flavor and texture experience is one of the most exciting. Give your mouth a relaxing job to do by popping one of these licorice caramels in and letting is melt away slowly. Now that's what we like to call R&R in the candy world. "}, "42688378798267": {"id": "42688378798267", "name": "Sugar Daddy Caramel Pops - Large - 24ct", "prod_url": "https://www.candystore.com/products/sugar-daddy-caramel-pops-large", "img_url": "https://www.candystore.com/cdn/shop/products/Sugar-Daddy-Caramel-Pops-Large-24ct-CandyStore-com-599_2048x.jpg?v=1677177887", "price": 62.99, "desc": "Chewy Sugar Daddy caramel pops offer the best of everything when it comes to sweet snacking. These mouthwatering delights produce big flavor that no caramel fanatic can resist! The beauty is in the taste and the design. Each piece includes a generous bar of creamy caramel candy perched atop a convenient disposable stick. Simply peel the bright yellow wrapper and enjoy golden caramel confection to your heart's content without the gooey mess!Anytime is a great time to buy Sugar Daddy candy! Give them away during holidays, hide them in party favors or keep them around the pantry for days when you're craving something smooth and sweet. Since 1925, Sugar Daddies have been the go-to candy for caramel lovers. New sizes have been introduced over the years, but none compare to the large Sugar Daddy caramel pop. Take your mouth on a saccharine vacation with a box of nostalgic Sugar Daddy candies!"}, "42689890255035": {"id": "42689890255035", "name": "Cow Tales Caramel Sticks with Tumbler - 100ct", "prod_url": "https://www.candystore.com/products/cow-tales-sticks", "img_url": "https://www.candystore.com/cdn/shop/products/Cow-Tales-Caramel-Sticks-with-Tumbler-100ct-CandyStore-com-934_2048x.jpg?v=1677131740", "price": 59.99, "desc": "Cow Tales are the creation of Goetze's Candy. The company began in 1895 as the Baltimore Chewing Gum Company. The company's signature Caramel Cream was created in 1917 followed by the classic Cow Tale. This confection was very similar to the Caramel Cream, but instead of a small disc of chewy caramel it featured a long tube (or tail) with delectable cream running through the middle. Different flavors have been added, including strawberry, vanilla, chocolate and caramel apple, but the classic version is still often considered the best!"}, "42690809102523": {"id": "42690809102523", "name": "Ghirardelli Squares Milk Caramel - 55ct Bulk", "prod_url": "https://www.candystore.com/products/ghirardelli-milk-caramel-bulk-squares", "img_url": "https://www.candystore.com/cdn/shop/products/ghirardelli-milk-caramel-bulk-squares-1q23-wmark_2048x.jpg?v=1677494233", "price": 49.99, "desc": "Ghirardelli Milk Caramel Bulk Squares 0. 53oz - 660ct"}, "42690360508603": {"id": "42690360508603", "name": "Caramel Awake Caffeinated Chocolate Bites - 50ct", "prod_url": "https://www.candystore.com/products/awake-caramel-caffeinated-chocolate-bites-058oz", "img_url": "https://www.candystore.com/cdn/shop/products/Caramel-Awake-Caffeinated-Chocolate-Bites-50ct-CandyStore-com-657_2048x.jpg?v=1677668289", "price": 54.99, "desc": "Awake Caramel Caffeinated Chocolate Bites 0.58oz - 50ct"}, "42690269348027": {"id": "42690269348027", "name": "Milk & Dark Chocolate Sea Salt Caramels - 10lb", "prod_url": "https://www.candystore.com/products/milk-and-dark-chocolate-sea-salt-caramels", "img_url": "https://www.candystore.com/cdn/shop/products/Milk-And-Dark-Chocolate-Sea-Salt-Caramels-10lb-CandyStore-com-156_2048x.jpg?v=1677158398", "price": 79.99, "desc": "Milk And Dark Chocolate Sea Salt Caramels - 10lb"}, "42689673330875": {"id": "42689673330875", "name": "Matlow Sour Lemon Hard Candies - 5.75lb Bulk", "prod_url": "https://www.candystore.com/products/matlow-sour-lemon", "img_url": "https://www.candystore.com/cdn/shop/products/Matlow-Sour-Lemon-5-75lb-CandyStore-com-929_2048x.jpg?v=1677157707", "price": 49.99, "desc": "Matlow Sour Lemon - 5.75lb"}, "42726977437883": {"id": "42726977437883", "name": "Caramel Swirl Salt Water Taffy - 2.5lb", "prod_url": "https://www.candystore.com/products/caramel-swirl-salt-water-taffy", "img_url": "https://www.candystore.com/cdn/shop/products/Caramel-Swirl-Salt-Water-Taffy-5lb-CandyStore-com-630_2048x.png?v=1677668520", "price": 19.99, "desc": "Caramel swirl salt water taffy is a rich, chewy treat that you'll love to eat! Anyone who adores the sweet, savory flavor of classic caramel must experience the taste of our salt water taffy. Each piece recreates the feeling of eating a bite-sized piece of high quality caramel but with that taffy texture you know and love.Our salt water taffy is available in single-flavor packages so you get exactly what you want every time you order! Bulk caramel swirl salt water taffy can be used for events and much more. Fill treat bags or wedding favors with these elegant little pinwheels. Each includes a toasty brown hue that's accented by a slender spiral swirl of white.Each piece arrives individually wrapped so it stays fresh and enjoyable. Order our caramel saltwater taffy for your next event or keep a package at home or at the office to eat as a quick snack!"}, "42688412156091": {"id": "42688412156091", "name": "Cadbury Caramello Chocolate Bars - 14ct", "prod_url": "https://www.candystore.com/products/cadbury-caramello-chocolate-bars", "img_url": "https://www.candystore.com/cdn/shop/products/Cadbury-Caramello-Chocolate-Bars-14ct-CandyStore-com-563_2048x.jpg?v=1677667262", "price": 58.99, "desc": "Bite size pieces of pure bliss is what you enjoy with this bulk supply of Cadbury Caramello Chocolate Bars. Each of the bars has 18 individual squares that are easy to break or cut apart. So, you can serve them to your guests on a tray for dessert, if you can bring yourself to share. Although originated in the United Kingdom, today The Hershey Company has a license to manufacture the divine line of Cadbury products in the United States. Whether you buy them in America or the UK, they are the same mouthwatering, melt-in-your-mouth bars of delicious goodness. Decadent milk chocolate is poured over creamy caramel and hardened. So, although the chocolate is firm on the outside, when you bite into them the gooey caramel comes oozing out. Your taste buds will be dancing. These large Cadbury Caramello Chocolate Bars make great stocking stuffers or last minute gifts for coworkers."}}