{
    "42688376078523": {
        "id": "42688376078523",
        "name": "Sour Patch Kids Assorted - 5lb",
        "prod_url": "https://www.candystore.com/products/sour-patch-kids",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sour-Patch-Kids-Assorted-5lb-CandyStore-com-920_2048x.jpg?v=1677175842",
        "price": 28.99,
        "desc": "You'll be puckering up for a long, long time with this bulk bag of Sour Patch Kids. With a tart, sugary bite followed by a sweet reprieve, it's no wonder why they're one of America's favorite candies. First sour and then sweet these little trouble makers will wreak havoc on your mouth in the most delicious way possible. In green lime, lemon yellow, orange, and red raspberry, there's a flavor for every sour-lover. Bring them to a sporting event for a tasty snack or try them in a glass of lemonade. With hours of tartness in every pack, you'll be all puckered out!"
    },
    "42688605716667": {
        "id": "42688605716667",
        "name": "Peach Os Gummi Rings - 5lb",
        "prod_url": "https://www.candystore.com/products/peach-gummy-rings",
        "img_url": "https://www.candystore.com/cdn/shop/products/Peach-Os-Gummi-Rings-5lb-CandyStore-com-478_2048x.jpg?v=1677163595",
        "price": 25.99,
        "desc": "Peach O's Gummy Rings are delicious sugar coated peach flavored gummies made with artificial and natural flavors. These O's make perfect additions to any candy buffet or on their own for grab and go treats. Peach O's Gummy Rings can be used as decorative toppers to other baked goods and a variety of sweet treats. Peach O's Gummies are sugary sweet with a fruity flavor and delicate gummy feel. Easy to chew and bite size for convenience. Use Peach O's for treat bags; kids will go crazy for these sugary candies. These gummies are red and yellow in color making them perfect for fall holidays, place in a cornucopia or use them to make a creepy Halloween treat. The O's can go perfectly into any cocktail or punch bowl for some added sweetness and swag."
    },
    "44600714199227": {
        "id": "44600714199227",
        "name": "Fruit Slices Candy - 5lb",
        "prod_url": "https://www.candystore.com/products/fruit-slices-candy",
        "img_url": "https://www.candystore.com/cdn/shop/products/Fruit-Slices-Candy-5lb-CandyStore-com-707_2048x.jpg?v=1677136391",
        "price": 39.99,
        "desc": "Fruit slices gummies are a fabulous treat that comes in many exciting flavors! If you love chewy gummy candy but want more options when it comes to taste, this is a must-try. Our delicious fruit slices candy include a flat wedge shape slab of confection with a flat end and curved side. A white line runs along the curved edge, creating the look of a fruit rind. Every fruit slice is different based on its flavor. Grape is all purple while black cherry includes a red middle with blue \"rind\". We carry a huge variety of juicy flavors that also include lemon lime, cherry, strawberry banana, orange, pink grapefruit, peach, watermelon, sour apple, red raspberry and blue raspberry. If you can't decide on just one, you can instead choose our amazing assorted bulk fruit slices pack! This mouthwatering blend contains a little bit of everything so you can sample all your chewy favorites!"
    },
    "42688407929019": {
        "id": "42688407929019",
        "name": "Haribo Gummi Gold Bears - 5lb",
        "prod_url": "https://www.candystore.com/products/haribo-gold-gummi-bears",
        "img_url": "https://www.candystore.com/cdn/shop/products/Haribo-Gummi-Gold-Bears-5lb-CandyStore-com-969_2048x.jpg?v=1677143433",
        "price": 35.99,
        "desc": "Silly old bear. These classic Haribo Gold Gummi Bears are here in a bulk bag to bring you even more of the tasty flavors you love. In a selection of red, orange, yellow, green, and white, everyone in your family will find a cub to love. Sprinkle a few in Jell-O for a ''beary'' good surprise, add some to a make your own sundae bar, or wrap some up for a loved one to make their day extra special. Haribo first made their chewy debut in 1922 in Germany with the creation of the famous Gummi Bear. See for yourself why they earned the slogan, ''Kids and grown-ups love it so n the happy world of Haribo!'' "
    },
    "42688376668347": {
        "id": "42688376668347",
        "name": "Sour Patch Watermelon Slices - 5lb",
        "prod_url": "https://www.candystore.com/products/watermelon-slices",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sour-Patch-Watermelon-Slices-5lb-CandyStore-com-660_2048x.jpg?v=1677175970",
        "price": 28.99,
        "desc": "Sour Patch Watermelon Slices look like tiny, sugar-dusted pieces of watermelon. Their pink and green coloring makes them perfect to put out at any pink-themed party. They'll make a great addition to a bachelorette party or baby shower. They're also a perfect pick for Valentine's, as their sour taste is sure to make your guests pucker up! You can get these deliciously tart chewy watermelon candies in a big bulk bag, but don't let the size fool you. They'll be gone before you know it. "
    },
    "42688356286651": {
        "id": "42688356286651",
        "name": "Gummy Sour Inch Worms Candy - 5lb",
        "prod_url": "https://www.candystore.com/products/sour-inch-worms",
        "img_url": "https://www.candystore.com/cdn/shop/products/Gummy-Sour-Inch-Worms-Candy-5lb-CandyStore-com-885_2048x.jpg?v=1677142747",
        "price": 24.99,
        "desc": "These little gummy worms are cute and come in colors that are vibrant. They are a sour flavored gummy that is sure to please. Some of the colors that you can expect to see are red and yellow, blue and orange, and even green and yellow. These worms would be great to add on ice cream or to use at any party or gathering, as they are able to please both adults and children. You will also find that these will work great for Halloween. If you are looking for a candy that provides you with flavor and a bit of kick then this is just what you have been looking for. You can get a big bulk bag of these wonderful gummy worms that will be enough to allow many to take part in them. They are each one inch in size which is the perfect bite size so that you can eat a whole one at one time. "
    },
    "42688387317947": {
        "id": "42688387317947",
        "name": "Gummy Worms - 5lb",
        "prod_url": "https://www.candystore.com/products/gummy-worms-classic",
        "img_url": "https://www.candystore.com/cdn/shop/products/Gummy-Worms-5lb-CandyStore-com-645_2048x.jpg?v=1677142763",
        "price": 22.99,
        "desc": "Do you know the saying, ''the early bird catches the worm?'' Well, it originated with the discovery of these chewy and delicious Gummy Worms! Early birds will be lining up around the block to get these colorful and tasty worms because they're wriggling with fruity goodness that everyone will want to slurp down. Dig one of these bite-sized treats up for a midday snack or fun dessert topping. Whether you bring them back to your nest to surprise your little ones or keep them all to yourself, these yummy, creepy night crawlers won't see the light of day for long."
    },
    "42688785055931": {
        "id": "42688785055931",
        "name": "Gummy Rainforest Frogs Candy - 2.2lb",
        "prod_url": "https://www.candystore.com/products/gummy-tropical-frogs",
        "img_url": "https://www.candystore.com/cdn/shop/products/gummy-tropical-frogs-1q23-wmark_2048x.jpg?v=1678473077",
        "price": 21.99,
        "desc": "Gummy tropical frogs are a fun candy that kids will absolutely love. Each piece features a traditional amphibian shape with rounded body, bent rear legs, and little toes. The back includes realistic detail along with a pair of eyes. Each gummy frog has a yellow belly, green body, and colorful legs in yellow, red, or blue. Put the finishing touches on a birthday party or picnic with our tropical frog gummies!"
    },
    "42688355860667": {
        "id": "42688355860667",
        "name": "Green Apple Gummy Rings Candy - 5lb",
        "prod_url": "https://www.candystore.com/products/apple-rings-gummy-candy",
        "img_url": "https://www.candystore.com/cdn/shop/products/Green-Apple-Gummy-Rings-Candy-5lb-CandyStore-com-152_2048x.jpg?v=1677141364",
        "price": 23.99,
        "desc": "Apple gummy rings are sweet, chewy and so delightful! The ring gummy has become a fast favorite among young and old alike. They are soft and tasty but offer a simple hoop shape with an open middle and curved sides. Each piece includes a bright Granny Smith apple green side and a creamy white side, with both covered in an irresistible sugar coating. Enjoy our bulk gummy rings in one flavor or try all your favorites! Each package contains a single flavor so you get exactly what you want when making shower or wedding favors or when stocking snacks at home or the office. Buy our apple gummy rings alone or browse our other gummy ring flavors to build your own custom candy assortment. These deliciously chewy treats are also great for home crafts and edible displays. Use gummy rings to decorate cakes and cookies or add a fun wreath to gingerbread houses!\r\n\r\nWe're green with envy just thinking about the lucky munchers of these yummy gummies! Sugary, sweet, and packed with a green apple punch, these green and white candies really hit the spot. Put them on your fingers and pop them in your mouth one at a time. Spruce up a St. Patrick's day candy display. Even set some out for wedding or birthday party guests to munch on. Whatever you do, these green apple gummy rings are coated with enough sugar and taste to make everyone smile, chew after chew. So what are you waiting for? Make us wish we had a bag of our own. \r\n\r\nBright green coloration, boldly contrasting with a creamy white alternate side, might account for the popularity of the Apple Gummy Rings candy, but we think the flavor probably has more to do with it!A tasty sweet treat that offers a vivid alternative to traditional confections like chocolate, bulk apple rings sparkle with a sugar coating over their neon loops. Use them to stud a frosted sweet for a mod polka-dot look, or watch them rapidly disappear from a dish or jar!These sweets are a smart choice for candy shops and novelty stores where an impulsively-bought treat boosts sales. They're also excellent for candy buffets, with their bright apple green color, Green Apple Gummi Rings fill out an unusual part of the spectrum, making them a tasty, chewy essential for colorful summertime settings or 1980s parties!"
    },
    "42688407896251": {
        "id": "42688407896251",
        "name": "Haribo Gummi Gold Bears Mini Bags - 54ct Tub",
        "prod_url": "https://www.candystore.com/products/haribo-gummi-gold-bears-mini-bags-tub",
        "img_url": "https://www.candystore.com/cdn/shop/products/Haribo-Gummi-Gold-Bears-Mini-Bags-54ct-Tub-CandyStore-com-153_2048x.jpg?v=1677143412",
        "price": 23.99,
        "desc": "We sure think that these gummies are ''tastier than the average bear!'' That's because these classic Haribo Gold Gummi Bears are here in a bulk bag to bring you even more of the delicious flavors you love. In a selection of red, orange, yellow, green, and white, everyone in your family will find a cub to love. Sprinkle a few in Jell-O for a ''beary'' good surprise, add some to a make your own sundae bar, or wrap some up for a loved one to make their day extra special. Haribo first made their chewy debut in 1922 in Germany with the creation of the famous Gummi Bear. "
    },
    "42688393871547": {
        "id": "42688393871547",
        "name": "Gummi Killer Sharks - 6.6lb",
        "prod_url": "https://www.candystore.com/products/gummi-killer-sharks-blue-white",
        "img_url": "https://www.candystore.com/cdn/shop/products/Gummi-Killer-Sharks-6-6lb-CandyStore-com-480_2048x.jpg?v=1677142217",
        "price": 42.99,
        "desc": "Don't worry. These killer shark gummies are real softies. As a matter of fact, they are way more afraid of your chompers than of their own! (Cue ''Jaws'' music). With blue and white coloring, they're a bright and tasty candy for a number of events. Delight your kids and throw them a pirate birthday party complete with these toothed treats or pack some into their lunchboxes on a special day. Everyone will have fun playing with these big fish until it's time for them to swim into your mouth. They might even be the yummiest fish in under the sea."
    },
    "42690246574267": {
        "id": "42690246574267",
        "name": "Gummy Strawberries & Cream Candy - 5lb Bulk",
        "prod_url": "https://www.candystore.com/products/kervan-gummy-strawberries-and-cream",
        "img_url": "https://www.candystore.com/cdn/shop/products/Kervan-Gummy-Strawberries-And-Cream-5lb-CandyStore-com-74_2048x.jpg?v=1677150520",
        "price": 24.99,
        "desc": "Kervan Gummy Strawberries And Cream - 5lb"
    },
    "42688382402747": {
        "id": "42688382402747",
        "name": "Sour Gummi Peach Hearts - 6.6lb",
        "prod_url": "https://www.candystore.com/products/sour-gummi-peach-hearts",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sour-Gummi-Peach-Hearts-6-6lb-CandyStore-com-9_2048x.jpg?v=1677175531",
        "price": 48.99,
        "desc": "Sour gummy hearts are available now in succulent peach! There's something irresistible about the smooth, chewy texture of high quality gummies combined with the sweet taste of fresh fruit. Now you can get your chewy, fruity fix whenever you need it with our sour peach gummies!This irresistible treat arrives in a fun heart shape. One half is a rich gold color while the other is bold red, much like the skin of a ripe peach! Sweet gummies are great, but sometimes you need a little more bite with your candy. The adventurous confection connoisseur will love the sour sugar coating that covers all sides of each peach heart. Every bite is an experiment in sweet, sour and peach! The heart shape is perfect for Valentine's Day or can be given in decorative gift bags or boxes as wedding favors. Remember to buy plenty because everyone will want to try your sour peach gummy hearts!"
    },
    "42688381550779": {
        "id": "42688381550779",
        "name": "Gummi Sour Cherry Cola Bottles - 6.6lb",
        "prod_url": "https://www.candystore.com/products/gummi-sour-cherry-cola-bottles",
        "img_url": "https://www.candystore.com/cdn/shop/products/Gummi-Sour-Cherry-Cola-Bottles-6-6lb-CandyStore-com-832_2048x.jpg?v=1677142424",
        "price": 43.99,
        "desc": "These Sour Cherry Cola Bottle Gummies are just so stinkin', cheek-pinchin' cute that we can't contain ourselves! That's because these ''pint'' sized treats are a perfect gummy replication of a cherry cola classic. Doused in a coating of crystally sugar, these gummies are packed with the traditional sour Cherry Coke taste. Bring them to a party to please cola and candy lovers, alike! Save some to put in a candy jar on the refreshment table at your next backyard picnic. Even make up cute little bags of these gummies to give away to friends. We're sure you'll ''drink'' in the deliciousness of these favorite gummies."
    },
    "42688726827195": {
        "id": "42688726827195",
        "name": "Jelly-Filled Gummy Turtles - 2.2lb Vidal",
        "prod_url": "https://www.candystore.com/products/jelly-filled-gummy-turtles-vidal",
        "img_url": "https://www.candystore.com/cdn/shop/products/Jelly-Filled-Gummy-Turtles-2-2lb-Vidal-CandyStore-com-577_2048x.jpg?v=1677149022",
        "price": 18.99,
        "desc": "Vidal turtle gummies are jelly-filled and offer amazing detail and a taste that's irresistible. Chewy candy is a great way to satisfy a demanding sweet tooth. If you want something different for snack time or are looking for a party food that will earn tons of complements, you must try these playful little sea creatures. Vidal has been making candy for over 50 years. In that time they have managed to perfect their delicious products, which is why we have one-of-a-kind candies like these chewy jelly-filled gummy turtles!Each piece includes an adorable sea turtle shape, with a round head and small knob feet. A pair of large round eyes extend from the sides of the head while the back rises to form a thick shell. Each back is decorated in a classic turtle pattern with square shapes in dark green or bold red. Our Vidal filled gummy turtles are a must-have for beach themed parties and summer events. "
    },
    "42688355926203": {
        "id": "42688355926203",
        "name": "Blue Raspberry Gummy Rings Candy - 5lb",
        "prod_url": "https://www.candystore.com/products/blue-raspberry-rings-gummy-candy",
        "img_url": "https://www.candystore.com/cdn/shop/products/Blue-Raspberry-Gummy-Rings-Candy-5lb-CandyStore-com-760_2048x.jpg?v=1677665134",
        "price": 24.99,
        "desc": "Everyone loves the sugary, chewy taste of gummy rings! There's something fun about the round shape and open center that is the trademark of this type of candy. Stretch them, wear them as a ring or take a bite and savor the sweet taste of blue raspberry. Each gummy ring includes a soft center that's covered in a dusting of delectable sugar. Our blue raspberry version features a half white and half blue pattern. The two color combination makes these a great choice for baby showers and wedding favors. Hand them out at birthday parties or use them to make a child's holiday even sweeter. Our bulk gummy rings are also great for use in edible crafts and party games. Let children thread them on a string to make wearable bracelets that they can eat! Use them to dress up gingerbread houses with snowy texture. No matter how you enjoy them, our gummy rings will make any event or project even better!"
    },
    "42688376144059": {
        "id": "42688376144059",
        "name": "Swedish Fish Assorted - 5lb",
        "prod_url": "https://www.candystore.com/products/swedish-fish-assorted",
        "img_url": "https://www.candystore.com/cdn/shop/products/Swedish-Fish-Assorted-5lb-CandyStore-com-464_2048x.jpg?v=1677179467",
        "price": 28.99,
        "desc": "Swedish Fish are one of the world's most classic and recognizable gummy candies. The red candy fish are instantly recognizable, and they're guaranteed to get your mouth watering. As if that wasn't good enough, you can get a big bulk bag of assorted flavors and colors of the classic gummy candy fish. That's right; you can get them in red, yellow, green, and orange, too. It's a simple and delicious twist on an old favorite. "
    },
    "42688408355003": {
        "id": "42688408355003",
        "name": "Haribo Happy Cola Bottles - 5lb",
        "prod_url": "https://www.candystore.com/products/haribo-gummi-cola-bottles",
        "img_url": "https://www.candystore.com/cdn/shop/products/Haribo-Happy-Cola-Bottles-5lb-CandyStore-com-212_2048x.jpg?v=1677143718",
        "price": 24.99,
        "desc": "There's nothing like a cold glass of bubbling, refreshing cola on a hot summer's day. Well, unless you count these amazing little Haribo Gummi Cola Bottles! With a sharp, cola flavor and the delicious chew Haribo is famous for, all your sweet snackers will love you for bringing these home. Bring some to your next picnic, add a festive element to a backyard BBQ, or even keep some around the house for snacking. Haribo first made their chewy debut in 1922 in Germany with the creation of the famous Gummi Bear. See for yourself why they earned the slogan, ''Kids and grown-ups love it so the happy world of Haribo!''These are the regular sized Haribo cola bottles. They do not have any writing on them. The Super Cola Bottles are larger and have Haribo written on them. "
    },
    "42688376307899": {
        "id": "42688376307899",
        "name": "Swedish Fish Red - 5lb",
        "prod_url": "https://www.candystore.com/products/swedish-fish-red",
        "img_url": "https://www.candystore.com/cdn/shop/products/Swedish-Fish-Red-5lb-CandyStore-com-447_2048x.jpg?v=1677179595",
        "price": 28.99,
        "desc": "It's not polite to fish for compliments. But these gilled little gummies just can't help themselves! With their bright, cherry flavor and craveable chewiness, Swedish fish have swam their way out of the sea into the hearts of millions. The original flavor and shape of their brand, these little swimmers have inspired the Swedish Fish AquaLife variety as well as Assorted colors and flavors. They've quickly become the biggest fish in the pond and are a beloved candy staple for people around the world. Dive into this bulk bag and ''sea'' for yourself what all the fuss is about. "
    },
    "42688362250427": {
        "id": "42688362250427",
        "name": "Sour Wacky Watermelon Gummy Bears - 6.6lb",
        "prod_url": "https://www.candystore.com/products/watermelon-pink-gummi-bears",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sour-Watermelon-Gummi-Bears-6-6lb-CandyStore-com-162_2048x.jpg?v=1677177026",
        "price": 36.99,
        "desc": "Who doesn't love the flavor of watermelon? This gummies have the great flavor that you love as well as the fun and exciting color of pink. The texture is fun and chewy. This is a great item for children and even adults. It will be fun to add to a candy buffet for your next birthday party. If you are looking for the fun and exciting flavor of watermelon without the mess, pain of cutting the watermelon, and the seeds that come with real fresh watermelon then this is what you need. These great gummy bears are approximately one inch each in size. This is sure to make your mouth water and keep you coming back for more."
    },
    "42688618627259": {
        "id": "42688618627259",
        "name": "Orange Slices Candy - 15lb",
        "prod_url": "https://www.candystore.com/products/orange-slices-candy",
        "img_url": "https://www.candystore.com/cdn/shop/products/Orange-Slices-Candy-15lb-CandyStore-com-175_2048x.jpg?v=1677162697",
        "price": 52.99,
        "desc": "At last! We've finally found a delicious chewy candy that does grow on trees! These Orange Slices Candy have all the yummy flavor of fresh squeezed oranges and are a beautiful treat to look at. Coated in sugar with a bright, orange color, these gummies are a refreshing and sweet burst that will please any candy fan. Bring some to a beach party for a summery, festive treat, add some to a punch bowl to add a burst of bright color and sweet flavor, or even wrap some up in a gift bag for a fruity surprise. Orange you glad we told you about these sweet treats?Approximately 32 pieces per pound"
    }
}