{
    "42689206059195": {
        "id": "42689206059195",
        "name": "Gourmet Salt Water Taffy - Bulk",
        "prod_url": "https://www.candystore.com/products/salt-water-taffy-flavors",
        "img_url": "https://www.candystore.com/cdn/shop/products/Gourmet-Salt-Water-Taffy-5lb-CandyStore-com-768_2048x.jpg?v=1677140500",
        "price": 19.99,
        "desc": "No one can resist the smooth texture and mouthwatering flavor of classic saltwater taffy! This nostalgic delight emerged from Atlantic City, NJ to become one of the most popular confections in the world. Often used in wedding favors or given as a special gift, saltwater taffy is sure to please any sweet tooth! Each individually wrapped piece includes rich molasses, sea salt and palm oil to produce that creamy taste experience that has everyone reaching for a second piece, or even a third and fourth!Saltwater taffy comes in a long list of delicious flavors, each featuring its own unique color. The many pastel hues, like yellow, pink and orange, harken back to this candy's seaside origins. You'll love sampling each distinct flavor, like caramel swirl or root beer float! Nothings better than a stroll along the boardwalk with watermelon or raspberry saltwater taffy. Explore our flavor list today and discover your new favorite beach snack!\r\n\r\nChoose from over 60 different flavors or mixes. When all flavors and mixes are available, there are more than 60 to choose from. The Assorted Taffy mix contains about 15 flavors."
    },
    "42688673546427": {
        "id": "42688673546427",
        "name": "Chocolate Cigars - 24ct",
        "prod_url": "https://www.candystore.com/products/chocolate-cigars",
        "img_url": "https://www.candystore.com/cdn/shop/products/Chocolate-Cigars-24ct-CandyStore-com-983_2048x.jpg?v=1677670367",
        "price": 28.99,
        "desc": "Back in the day, no trip to the delivery room was complete without a celebratory cigar. Nowadays, you can spread the joy of the birth of a new baby in a yummier and healthier way with these Chocolate Cigars. They are an innocent and delicious way to celebrate any exciting occasion, look official in their bright, gold wrappers, and come in traditional, little boxes that resemble the humidors of old. In every amazing box, you can enjoy rich, melty chocolate that's perfect for celebrating a growing family. Puff, savor, and celebrate with every delicious chocolate cigar in this bulk selection. "
    },
    "42689223033019": {
        "id": "42689223033019",
        "name": "Bulk M&M's Candy - 10lb Individual Colors",
        "prod_url": "https://www.candystore.com/products/mms-individual-colors",
        "img_url": "https://www.candystore.com/cdn/shop/products/Bulk-M-M-s-Candy-10lb-Individual-Colors-CandyStore-com-279_2048x.jpg?v=1677666773",
        "price": 145.99,
        "desc": " It's undeniable that M&M's Candy is a household name, but the story behind its moniker is a nugget of sweet history. Named for the partnership of Forest Mars and Bruce Murrie in 1941, this candy is not just an edible delight, but a legacy. These pioneers brought us the melty, milk chocolate bliss encased in a colorful shell that has captured hearts around the world and remains a top pick in candy stores everywhere.\nThe joy that M&M's bring isn’t just in their taste but also in their vibrant spectrum. With hues spanning from the bluest skies to sunniest yellows and the deepest reds, these candies brighten any occasion. A bulk candy buy of M&M's is not just a purchase; it's an investment in a kaleidoscope of joy that can be savored in every tiny, chocolatey piece.\nWhen you visit your local candy store, the sight of bulk M&M's candies inspires more than just snacking. These colorful morsels are a baker's best friend, adding a pop of color and a rich, chocolatey taste to all sorts of baked goods. Imagine the smiles when you unveil a cake dotted with these iconic candies or cookies that reveal a chocolate surprise with every bite.\nBut the fun doesn’t stop there. The bulk M&M's experience is perfect for crafting personalized goodie bags for parties, creating vibrant candy tables, or filling pinatas to the brim for a shower of color and sweetness. In a candy store, M&M's in bulk are the go-to for any creative candy endeavor, from decorating to gifting, ensuring that your pantry is always stocked with a taste of happiness."
    },
    "42709387903163": {
        "id": "42709387903163",
        "name": "Jelly Belly Jelly Beans - 10lb",
        "prod_url": "https://www.candystore.com/products/jelly-belly-jelly-beans",
        "img_url": "https://www.candystore.com/cdn/shop/products/Jelly-Belly-Jelly-Beans-10lb-CandyStore-com-131_2048x.jpg?v=1677148077",
        "price": 86.99,
        "desc": "Indulge in the gourmet taste of Jelly Belly Jelly Beans, the candy that has become a classic treat across the nation. Now, your favorite candy store offers the excitement and joy of these tiny confections in a generous 10lb bulk candy pack. Each bean bursts with flavors so authentic, you'll feel like you're enjoying the real thing—whether it's juicy pear, luscious cherry, or any of the multitude of enticing options Jelly Belly is famed for.\nJelly Belly's dedication to quality and flavor variety transforms every moment into a taste adventure. When you purchase from a candy store that offers bulk candy, you're not just getting a snack; you're embarking on a flavor journey that spans the classic, the fruity, the spicy, and the absolutely unexpected. The 10lb bulk offering allows candy lovers to get their hands on a vast array of choices to suit any palate or occasion.\nAre you planning a large event or crafting the perfect candy buffet? Look no further than the vibrant variety of Jelly Belly Jelly Beans available in bulk. Your local candy store provides this ample quantity, ideal for weddings, corporate events, or for the true jelly bean aficionado who understands the joy of having a personal stash of these premium candies.\nFrom the moment you open the bag and the sweet aroma greets your senses, to the last bean you savor, Jelly Belly Jelly Beans in bulk are an experience. These beans aren’t just candy; they’re a versatile classic. Use them in your baking endeavors to add a pop of color and taste, or get creative with Jelly Belly-themed arts and crafts. Your bulk candy purchase is more than just a treat—it's a spark of creativity.\nTrue enthusiasts know that Jelly Belly Jelly Beans are not your average sweet. They're a gourmet delicacy crafted with care and precision. A bulk candy buy ensures that you have a diverse mix of Jelly Belly's 50 official flavors, allowing you to enjoy the flavors of the world one bean at a time. Whether it's the smooth creaminess of vanilla, the tang of green apple, or the tropical zing of mango, each Jelly Belly Jelly Bean is a microcosm of flavor waiting to explode in your mouth.\nWhen you choose to purchase Jelly Belly Jelly Beans in bulk from a respected candy store, you're not only getting a deal in quantity but also in taste. The 10lb package ensures that your pantry is always stocked for a sweet snack, a creative dessert garnish, or a colorful addition to party favors. Take advantage of the wide array of Jelly Belly Jelly Bean flavors that bulk candy offers and never run out of your favorite treat again."
    },
    "42688417464507": {
        "id": "42688417464507",
        "name": "Hershey's Minis Assorted Miniature Chocolate Bars - 6.25lb",
        "prod_url": "https://www.candystore.com/products/hersheys-mini-chocolate-candy-bars",
        "img_url": "https://www.candystore.com/cdn/shop/products/Hershey-s-Minis-Assorted-Miniature-Chocolate-Bars-6-25lb-CandyStore-com-801_2048x.jpg?v=1677145120",
        "price": 69.99,
        "desc": "Good things come in small packages. But they can certainly come in big ones too! And this bulk assortment of Hershey's Milk Chocolate, Hershey's Dark Chocolate, Mr. Goodbar, and Krackel mini candy bars is definitely an example of a very good thing. Founded in 1894, Hershey has been pumping out delicious candy bars long before any of us were around to enjoy them. That's why with their time-tested quality and handcrafted taste, you'll be snacking happily for a long time. And now with this bulk bag, you'll be able to get your entire family's favorite candy bars in one package."
    },
    "42688511574203": {
        "id": "42688511574203",
        "name": "Milk Chocolate Gold Gelt Coins - 10lb Assorted Sizes",
        "prod_url": "https://www.candystore.com/products/milk-chocolate-gold-coins-assorted",
        "img_url": "https://www.candystore.com/cdn/shop/products/Milk-Chocolate-Gold-Gelt-Coins-10lb-Assorted-Sizes-CandyStore-com-60_2048x.jpg?v=1677158777",
        "price": 228.99,
        "desc": "We have enough Milk Chocolate Gold Gelt Coins here to fill Fort Knox! You'll feel richer the moment you bring them home because of their brilliant, gold foil wrappers that are designed to look like coins and the tasty, melty chocolate that awaits within. Are you a poker player or fan of a casino night with friends now and again? Why not sweeten the pot‚Äîliterally‚Äîby ordering some of these Milk Chocolate Gold Gelt Coins and adding them to the stakes. They also make great payment for chores done by your children, fun giveaways in pinatas or goodie bags or in a big pot on St. Patrick's Day to look like a pot of gold! Use your \"cent-ses\" and bring home some of these Milk Chocolate Gold Gelt Coins today!"
    }
}