{"42688416809147": {"id": "42688416809147", "name": "Good & Plenty - 5lb Bulk", "prod_url": "https://www.candystore.com/products/good-plenty", "img_url": "https://www.candystore.com/cdn/shop/products/Good-Plenty-5lb-Bulk-CandyStore-com-113_2048x.jpg?v=1677140381", "price": 25.99, "desc": "Good & Plenty is one of the most famous licorice candies ever to come from the United States. This popular confection consists of sweet licorice pieces that are shaped into smooth, round capsules. Each tasty capsule is coated in a hard candy shell which produces the recognizable pink and white hue. The Good & Plenty name has been around since 1893 and continues to tempt anyone with a sweet tooth and love of chewy licorice. Our massive bag of Good & Plenty candy is the easiest way to get more of the confections you love! Order a bag or two to keep at home so you can always satisfy your licorice cravings without searching multiple stores for your favorite snack! Bulk candy is convenient for picnics, parties and holiday events. Toss a few in decorative bags for birthday or wedding favors or pour them into a glass dish to eat at home. No matter where you serve them, our bulk Good & Plenty candy bag will please any crowd!"}, "42689111031995": {"id": "42689111031995", "name": "Strawberry Licorice Broadway Wheels - 4.4lb", "prod_url": "https://www.candystore.com/products/strawberry-licorice-wheels", "img_url": "https://www.candystore.com/cdn/shop/products/Strawberry-Licorice-Broadway-Wheels-4-4lb-CandyStore-com-522_2048x.jpg?v=1677177943", "price": 32.99, "desc": "Strawberry flavored red licorice wheels, aslo known as Broadway Wheels! Red licorice wheels from Gerrit Verburg are famous world round."}, "42690219409595": {"id": "42690219409595", "name": "Claey's Licorice Drops 6oz Bag - 24ct", "prod_url": "https://www.candystore.com/products/claeys-licorice-drops-6oz-bag", "img_url": "https://www.candystore.com/cdn/shop/products/claeys-licorice-drops-6oz-bag-1q23-wmark_2048x.jpg?v=1677493900", "price": 55.99, "desc": "Claey's Licorice Drops 6oz Bag - 24ct"}, "42690322071739": {"id": "42690322071739", "name": "Scottie Dogs Black Licorice - 10lb", "prod_url": "https://www.candystore.com/products/scottie-dogs-black-licorice", "img_url": "https://www.candystore.com/cdn/shop/products/scottie-dogs-black-licorice-1q23-wmark_2048x.jpg?v=1677495469", "price": 79.99, "desc": "Scottie Dogs Black Licorice - 10lb"}, "42690321842363": {"id": "42690321842363", "name": "Scottie Dogs Red Licorice - 10lb", "prod_url": "https://www.candystore.com/products/scottie-dogs-red-licorice", "img_url": "https://www.candystore.com/cdn/shop/products/scottie-dogs-red-licorice-1q23-wmark_2048x.jpg?v=1677495470", "price": 79.99, "desc": "Scottie Dogs Red Licorice - 10lb"}, "42688398360763": {"id": "42688398360763", "name": "Licorice Caramels - 4.4lb", "prod_url": "https://www.candystore.com/products/licorice-caramels", "img_url": "https://www.candystore.com/cdn/shop/products/Licorice-Caramels-4-4lb-CandyStore-com-988_2048x.jpg?v=1677153195", "price": 52.99, "desc": "The mad scientists of the candy world have created a magical hybrid of flavors! We're talking about our licorice caramels and can't wait for you to bring some home and take a bite. In a dark chocolatey brown, these cellophane wrapped black caramels have the delicious creaminess of caramel and the bite of licorice so the flavor and texture experience is one of the most exciting. Give your mouth a relaxing job to do by popping one of these licorice caramels in and letting is melt away slowly. Now that's what we like to call R&R in the candy world. "}, "42688397672635": {"id": "42688397672635", "name": "Black Licorice Coins - 6.6lb", "prod_url": "https://www.candystore.com/products/black-licorice-coins", "img_url": "https://www.candystore.com/cdn/shop/products/Black-Licorice-Coins-6-6lb-CandyStore-com-329_2048x.gif?v=1677664544", "price": 85.99, "desc": "These Black Licorice Coins have a strong flavor, with a hint of salmiak salt. They are firm to the touch, but bite into them and the heat from your mouth makes them super chewy. Fill your candy dish with these and you will always be able to satisfy your craving for traditional Dutch black licorice any time you want. Are you one of those people who is always disappointed with bags and boxes of candy because there is never enough black licorice ones? Order this bulk supply of Black Licorice Coins and you will never be disappointed again. These sweet and salty coins are manufactured by Kraepelien & Holm, which happens to be one of Holland's oldest licorice factories. It dates all the way back to 1876. In case you didn't know, the Dutch are black licorice connoisseurs and consume more of it than any other country. These mouthwatering Black Licorice Coins are imported from the country that knows a thing or two about licorice."}, "42689110704315": {"id": "42689110704315", "name": "Licorice Wheels - 4.4lb", "prod_url": "https://www.candystore.com/products/licorice-wheels", "img_url": "https://www.candystore.com/cdn/shop/products/Licorice-Wheels-4-4lb-CandyStore-com-34_2048x.jpg?v=1677153686", "price": 31.99, "desc": "Licorice Wheels - 4.4lb"}, "42690319614139": {"id": "42690319614139", "name": "Scottie Dogs Red Licorice Jelly Belly - 12ct", "prod_url": "https://www.candystore.com/products/jelly-belly-scottie-dogs-red-licorice-275oz", "img_url": "https://www.candystore.com/cdn/shop/products/jelly-belly-scottie-dogs-red-licorice-275oz-1q23-wmark_2048x.jpg?v=1677494541", "price": 35.99, "desc": "Jelly Belly Scottie Dogs Red Licorice 2.75oz - 12ct"}, "42689868857531": {"id": "42689868857531", "name": "Juicy Twists All Flavors - 12lb Kenny's", "prod_url": "https://www.candystore.com/products/kenny-licorice-juicy-twists", "img_url": "https://www.candystore.com/cdn/shop/products/Juicy-Twists-All-Flavors-12lb-Kenny-s-CandyStore-com-701_2048x.jpg?v=1677150136", "price": 41.99, "desc": "These amazing twists will put your tongue into a tailspin! That's because you will have swirl after swirl of bright, fruity taste in a rainbow of colors and flavors to try. Choose from, black licorice, cherry licorice, blue raspberry, chocolate, grape, green apple, peach, pineapple, peach, pina colada, red raspberry, root beer, spicy cinnamon, strawberry red, or watermelon! They make a delicious snack for kids, can be used as straws in cold drinks and make a perfect addition to any party of candy bar buffet. These ropes will tie your taste buds up in knots, but we're sure it's a tangle you and your mouth won't mind!"}, "42688397246651": {"id": "42688397246651", "name": "Black Cats Licorice - 6.6lb", "prod_url": "https://www.candystore.com/products/black-cats-licorice-22lbs", "img_url": "https://www.candystore.com/cdn/shop/products/black-cats-licorice-22lbs-1q23-wmark_2048x.jpg?v=1677493686", "price": 99.99, "desc": "Are you ready to test out if the urban legends are true? Black cats bringing bad luck is one of them. But we don't think these Black Cat Licorices are capable of giving people bad luck. In fact, we hope they come across our path more often! With this bulk bag of cat candies, you'll have plenty of time to decide for yourself. With adorable mini whiskers, tasty paws and beautiful black fur, every muncher of these meowers will be in for a treat. Use them on Halloween for an extra thematic touch or give them to a friend who loves cats! Whatever you do, these delicious licorice felines will make your taste buds purr."}, "42688922976443": {"id": "42688922976443", "name": "Broadway Licorice Rolls Strawsberry Red - 24ct", "prod_url": "https://www.candystore.com/products/broadway-rolls-red-licorice-straws", "img_url": "https://www.candystore.com/cdn/shop/products/Broadway-Licorice-Rolls-Strawsberry-Red-24ct-CandyStore-com-237_2048x.jpg?v=1677666126", "price": 40.99, "desc": "Rolled up strips of strawberry licorice are fit for Broadyway! These red licorice rolls will be the star of the show in your mouth. Try this lovely licorice candy roll."}, "42688569442491": {"id": "42688569442491", "name": "Anise Squares Candy - 10lb Bulk", "prod_url": "https://www.candystore.com/products/anise-squares", "img_url": "https://www.candystore.com/cdn/shop/products/Anise-Squares-Candy-10lb-Bulk-CandyStore-com-277_2048x.jpg?v=1677660019", "price": 65.99, "desc": "Anise square candies are a classic treat that's full of flavor! Anise is a flower that is native to Southwest Asia and the Mediterranean. Its flavor is akin to fennel and licorice. If you love the taste of anise but want to enjoy it without baking or cooking, our anise squares are an excellent choice. Each square includes hard candy that offers authentic anise taste that's smooth and delightful to the taste buds. Each anise candy is made even more appealing thanks to the semi-transparent red wrapper. Every piece is individually packaged so it remains fresh. Untwist the sides to open the bold wrapper and reach the square candy hidden inside. The combination of vibrant hues and classic taste makes this treat a satisfying way to fill candy dishes and jars. Use them to make wedding favors or treat bags for birthdays or hand them out during the holiday season!"}, "42688615448763": {"id": "42688615448763", "name": "Crows - Theater Size - 12ct", "prod_url": "https://www.candystore.com/products/crows-theater-size", "img_url": "https://www.candystore.com/cdn/shop/products/Crows-Theater-Size-12ct-CandyStore-com-588_2048x.jpg?v=1677132252", "price": 30.99, "desc": "If you love licorice but prefer to skip the twists, Crows candy are a must-try. This gumdrop confection is a delicious alternative to licorice ropes. Each piece is full of traditional licorice flavor. Every bite includes a short, domed shape √ê just like a classic gumdrop! Unlike classic gumdrops, Crows candy are solid black. The smooth surface adds a hint of shine that makes these ebony treats so eye-catching. The original Crows licorice candy was created over 100 years ago in the 1890s. The Black Crows brand was trademarked in 1911. It was later acquired by the famous Tootsie Roll Industries. Our bulk Crows theater box pack gives you more of your favorite fat free candy! Every bite is so delicious and a better snack compared to fattier foods. Our bulk theater box candies are convenient for events, gatherings and holidays. Give classic candy as a Christmas stocking stuffer or hand them out during family movie night!"}, "42726989070523": {"id": "42726989070523", "name": "Licorice Swirl Salt Water Taffy - 2.5lb", "prod_url": "https://www.candystore.com/products/licorice-swirl-salt-water-taffy", "img_url": "https://www.candystore.com/cdn/shop/products/Licorice-Swirl-Salt-Water-Taffy-5lb-CandyStore-com-868_2048x.jpg?v=1677153757", "price": 19.99, "desc": "Prepare to hypnotize your taste buds with these Licorice Swirl Salt Water Taffies. In a stark contrast of black and white swirls, these candies are as yummy to eat as they are to look at. Use them for a thematic addition to Halloween or a formal wedding reception. Discovered in the late 1800s, salt water taffy was the product of an unfortunate event. When a candy store owner's shop was flooded with sea water, he decided to market his soaked taffys to the public! What a happy accident this incident turned out to be, because people have incorporated taffy into their summer snacks and memories for generations."}, "42690186051771": {"id": "42690186051771", "name": "Unwrapped Twizzlers Strawberry Licorice - 5lb Bulk", "prod_url": "https://www.candystore.com/products/twizzlers-unwrapped-strawberry-licorice", "img_url": "https://www.candystore.com/cdn/shop/products/Twizzlers-Unwrapped-Strawberry-Licorice-5lb-CandyStore-com-961_2048x.jpg?v=1677183883", "price": 21.99, "desc": "Twizzlers Unwrapped Strawberry Licorice - 5lb"}, "42688748257467": {"id": "42688748257467", "name": "Twizzlers Cherry Bites Theater Box - 12ct", "prod_url": "https://www.candystore.com/products/twizzler-cherry-bites-theater-box", "img_url": "https://www.candystore.com/cdn/shop/products/Twizzlers-Cherry-Bites-Theater-Box-12ct-CandyStore-com-755_2048x.jpg?v=1677183448", "price": 36.99, "desc": "A sweet tooth can come in all shapes and sizes. For the daintier ones, try these Twizzlers Cherry Bites Theater Boxes! With classic red cherry licorice that Twizzlers is known for, these little candies are chopped up bits of the traditional licorice rope. Bring some of these Twizzlers Cherry Bites Theater Boxes to a matinee or open up a box right on your couch while watching a favorite flick and you'll have something to chew on for the whole movie. You can even eat some of these delicious and sweet Twizzlers Cherry Bites Theater Boxes at a sporting event while you're cheering on the home team. Do it all and more with an order of these Twizzlers Cherry Bites Theater Boxes!"}, "42689635778747": {"id": "42689635778747", "name": "Mini Licorice Allsorts - 6.6lb", "prod_url": "https://www.candystore.com/products/mini-licorice-allsorts", "img_url": "https://www.candystore.com/cdn/shop/products/Mini-Licorice-Allsorts-6-6lb-CandyStore-com-651_2048x.jpg?v=1677160045", "price": 55.99, "desc": "Mini Licorice Allsorts - 6.6lb"}, "42688418775227": {"id": "42688418775227", "name": "Good & Plenty King Size - 12ct", "prod_url": "https://www.candystore.com/products/good-plenty-king-size", "img_url": "https://www.candystore.com/cdn/shop/products/Good-Plenty-King-Size-12ct-CandyStore-com-922_2048x.jpg?v=1677140386", "price": 32.99, "desc": "What's prettier than a bouquet of flowers and tastier than a gourmet dessert? Good & Plenty candy, of course. Narrow cylinders of yummy black licorice are given lovely pink and white hard candy shells and packaged in these extra-large boxes, which are perfect for sharing. This bulk supply of Good & Plenty King Size includes 12 of these generous boxes that are ideal to have around for movie night or road trips. These delicious candies are certified kosher and fat-free, so you can indulge without all the guilt. Plus, they are fairly low in calories, and are actually a source of iron. What other candy can you think of that has been talked about on The Simpsons, The Sopranos, and Everybody Loves Raymond? They are definitely the coolest candy on the block, and you just might get a few cool points of your own when your pantry is stocked with Good & Plenty King Size candy."}, "42688397639867": {"id": "42688397639867", "name": "Black Licorice Bears Sugar Free - 6.6lb", "prod_url": "https://www.candystore.com/products/black-licorice-bears-sugar-free", "img_url": "https://www.candystore.com/cdn/shop/products/Black-Licorice-Bears-Sugar-Free-6-6lb-CandyStore-com-197_2048x.jpg?v=1677664538", "price": 79.99, "desc": "Meet these delicious and sugar free black licorice gummy bears. Bears are a very attractive animal, kids love them and so do adults and edible bears are the absolute best kind of all. Much like the real bear roams through the wild. The Black Licorice Sugar Free Bears are going to be roving to and fro throughout the wilderness of your mind. Their taste is haunting and it is virtually impossible for any person to eat only one of these licorice treats, because they are so delicious. These treats are coming to you all the way from Holland, leave it to the Dutch to take licorice and turn it into something irresistible and undeniably delicious. These candies can be bought in bulk so that you will never have to worry about going bear free. The sugar free tasty goodness of the licorice bear can be yours all day long!"}}