{
    "42688380174523": {
        "id": "42688380174523",
        "name": "Blow Pops Bulk - 6.5lb",
        "prod_url": "https://www.candystore.com/products/blow-pops-assorted-bulk",
        "img_url": "https://www.candystore.com/cdn/shop/products/Blow-Pops-Bulk-6-5lb-CandyStore-com-986_2048x.jpg?v=1677664755",
        "price": 36.99,
        "desc": "Any child of the 80s and 90s will remember the colorful commercials that aired for Charms Blow Pops. With flavors like watermelon, sour apple, cherry, strawberry and grape, these sugary treats were at the top of any kid's favorite candy list. Now you can relive those fun, bubblegum filled moments with our bulk Blow Pop pack! You receive an assortment of your favorite Charms lollipops that are perfect for birthday parties, picnics, holiday celebrations and other gatherings. Each Blow Pop starts with a hard fruit flavored candy shell. Chewy bubble gum is hidden inside, adding excitement to every lick! Our bulk candy pack includes individually wrapped lollipops that you can keep at home or use for events. Take them to hand out at your child's after school event or put a few in a jar at the office to share with coworkers. No kid ever gets too old to enjoy the sweet, sugary goodness of a classic Charms Blow Pop!"
    },
    "42688616104123": {
        "id": "42688616104123",
        "name": "Caramel Apple Pops - 48ct",
        "prod_url": "https://www.candystore.com/products/caramel-apple-pops",
        "img_url": "https://www.candystore.com/cdn/shop/products/Caramel-Apple-Pops-48ct-CandyStore-com-987_2048x.jpg?v=1677668259",
        "price": 22.99,
        "desc": "Enjoy the bounty of the autumn harvest without setting foot in an orchard. A play on a classic fall favorite, these classic green apple lollies are slathered in a creamy, chewy, caramel coating that has been greedily gobbled up for years. Bring them to a fall party, use them as Halloween treats, or remind yourself of autumn any time of the year. Every snacker will feel like you're on a tractor ride, traversing a corn maze, and smelling fresh bales of hay every time you eat one of these. And the best part is, these tart treats are here all year 'round."
    },
    "42688416710843": {
        "id": "42688416710843",
        "name": "Jolly Rancher Lollipops - 50ct",
        "prod_url": "https://www.candystore.com/products/jolly-rancher-lollipops",
        "img_url": "https://www.candystore.com/cdn/shop/products/Jolly-Rancher-Lollipops-50ct-CandyStore-com-506_2048x.jpg?v=1677149627",
        "price": 21.99,
        "desc": "Who doesn't love lollipops? Well now you can get great Jolly Rancher Lollipops. These come in a box of 5 of them. You will find that these have a fun tart, fruit flavor that nearly everyone is sure to enjoy. They also come in many different colors such as green, pink, blue, and red. Some of the flavors that you can expect with these great suckers are cherry, pink lemonade, watermelon, and even apple. That means that you are sure to have plenty of options when it comes to choosing a flavor that you are sure to enjoy. These are hard candies that are each wrapped individually. It really gives a great twist to the wonderful Jolly Rancher flavors that you have already come to love by allow them to now be suckers instead of just little hard candies. This means that you are able to enjoy more of the flavor at a time with only having to unwrap one piece. "
    },
    "42688616988859": {
        "id": "42688616988859",
        "name": "Tootsie Pops - 6.5lb Bulk",
        "prod_url": "https://www.candystore.com/products/tootsie-pops-bulk",
        "img_url": "https://www.candystore.com/cdn/shop/products/Tootsie-Pops-6-5lb-Bulk-CandyStore-com-479_2048x.jpg?v=1677181723",
        "price": 46.99,
        "desc": "A wise owl once asked, ''how many licks does it take to get to the center of a Tootsie Pop?'' We think the better question may be ''how many licks it will take to get to the bottom of this bulk Tootsie Pop box?'' We'll let you determine the right answer as you enjoy classic flavors or orange, chocolate, cherry, and grape lick after lick. The Tootsie Roll journey to the center of customers' hearts began in 1896 in New York City. We think the work is well worth the wait with a signature Tootsie Roll on the inside of every pop."
    },
    "42688379289787": {
        "id": "42688379289787",
        "name": "Charms Sweet & Sour Pops - 48ct",
        "prod_url": "https://www.candystore.com/products/charms-sweet-sour-pops",
        "img_url": "https://www.candystore.com/cdn/shop/products/Charms-Sweet-Sour-Pops-48ct-CandyStore-com-741_2048x.jpg?v=1677669056",
        "price": 21.99,
        "desc": "These lollipops sure are two-faced. But with one side of delicious, sweet fruity flavor and the other packed with a puckering sour punch, we don't think that's necessarily a bad thing at all! These classic Sweet and Sour Charms Pops will give you the best of both worlds sour and sweet. If your tongue gets tired of one flavorful sensation, simply flip this lolli around to find something new. Since WWI, Charms Pops have been delighting the world of candy lovers. Pass this bit of history along with this sweet and sour treat to all your friends and family. We're sure they'll love 'em!"
    },
    "42688784302267": {
        "id": "42688784302267",
        "name": "Dum Dums Pops Candy - 10lb Bulk",
        "prod_url": "https://www.candystore.com/products/dum-dums-pops",
        "img_url": "https://www.candystore.com/cdn/shop/products/Dum-Dums-Pops-10lb-CandyStore-com-93_2048x.jpg?v=1677134708",
        "price": 87.99,
        "desc": "Our bulk Dum Dum Pops pack is the best way to make sure you never run out of your favorite lollipops. Each lolly includes a white disposable stick and round hard candy top. Our assortment includes a huge variety of flavors that will leave your taste buds begging for more! Dum Dum Pops arrive individually wrapped so they're perfect for party favors and casual snacking."
    },
    "42688353697979": {
        "id": "42688353697979",
        "name": "Rainbow Whirly Pops 3\" - 60ct",
        "prod_url": "https://www.candystore.com/products/rainbow-whirly-pops-3-inch",
        "img_url": "https://www.candystore.com/cdn/shop/products/Rainbow-Whirly-Pops-3-60ct-CandyStore-com-622_2048x.jpg?v=1677169732",
        "price": 175.99,
        "desc": "Round and 'round they go. Where they stop, nobody knows! Get lost in the hypnotic swirl of our whimsical, carnival inspired Whirly Pops. With a fun-house feel, they will take you back to the fairgrounds of your youth. Hear the tinkling of carousel organs, silly honking of clown horns, and whooshing of thrilling rollercoasters with every lick. And with 6 pops per box, you'll have a ton of time to spend back in a carnival state of mind. So step right up, step right up and try them out for your next carnival-themed party or as a colorful gift basket addition. "
    },
    "42688757563579": {
        "id": "42688757563579",
        "name": "Fire Cube Cinnamon Suckers Tub - 100ct",
        "prod_url": "https://www.candystore.com/products/fire-cube-cinnamon-suckers-tub",
        "img_url": "https://www.candystore.com/cdn/shop/products/fire-cube-cinnamon-suckers-tub-1q23-wmark_2048x.jpg?v=1677494163",
        "price": 68.99,
        "desc": "Old fashioned cinnamon Cube Pops are a unique confection that harkens back to simpler times. There's something warm and cozy about the taste of traditional cinnamon. Each Cube Pop includes a disposable stick with a 3D square shaped hard candy on top. Each bright red piece is filled with classic cinnamon flavor that's sure to satisfy sweet cravings with a touch of nostalgia. They arrive individually wrapped, making Cube Pops a great choice for party favors and more."
    },
    "42688741703867": {
        "id": "42688741703867",
        "name": "Giant Tootsie Pops Lollipops - 72ct",
        "prod_url": "https://www.candystore.com/products/giant-tootsie-pops",
        "img_url": "https://www.candystore.com/cdn/shop/products/giant-tootsie-pops-1q23-wmark_2048x.jpg?v=1678387736",
        "price": 49.99,
        "desc": "When a regular sized Tootsie Pop isn't enough, you need a giant Tootsie Pop! This enormous lollipop offers more of the flavors you love in the same convenient package. Each features a similar design, with a chewy candy center and delicious hard candy outside. They come perched on a disposable white stick with a wrapper to maintain freshness. Our assortment includes all your favorite colors, which are indicated by the color of the lollipop's wrapper! Bulk giant Tootsie Pops are a great way to prepare for parties and other special events. Open the box and put it out for guests to grab and eat. Or divide your lollipops up into party favors for kids. They make a quick after school snack or can be taken to the office to share with coworkers! Young and old alike will love the taste of nostalgic Tootsie Pops - especially when they see the giant version!"
    },
    "42690551840955": {
        "id": "42690551840955",
        "name": "Blow Pops from Charms Candy - 100ct",
        "prod_url": "https://www.candystore.com/products/blow-pops",
        "img_url": "https://www.candystore.com/cdn/shop/products/Blow-Pops-from-Charms-Candy-100ct-CandyStore-com-381_2048x.jpg?v=1677664849",
        "price": 38.99,
        "desc": "Blow Pops - 100ct"
    },
    "42688353632443": {
        "id": "42688353632443",
        "name": "Unicorn Pops Mini - 48ct",
        "prod_url": "https://www.candystore.com/products/unicorn-pops-mini",
        "img_url": "https://www.candystore.com/cdn/shop/products/Unicorn-Pops-Mini-48ct-CandyStore-com-585_2048x.jpg?v=1677183929",
        "price": 49.99,
        "desc": "Just the sight of these hard-candied Unicorn Pops Mini lollipops can sweeten any soiree. Use them for a prize at a birthday party, or make a bouquet of them for wedding centerpieces. Since each one of these 6-inch Unicorn Pops Mini are individually wrapped they are also easy to stash in your purse, and kids of all ages will be excited to receive them at Halloween. Shaped just like the spiraling horn of folklore's most adored mystical animal, Unicorn Pops Mini suckers are as delicious as they are pretty. A rainbow of brilliant colors swirl tightly to create the look of the legendary horns said to have magical and medicinal properties. If only real medicine tasted this good!"
    },
    "44507167686843": {
        "id": "44507167686843",
        "name": "Charms Sweet Pops Lollipops Changemaker - 48ct",
        "prod_url": "https://www.candystore.com/products/charms-sweet-pops-lollipops-changemaker",
        "img_url": "https://www.candystore.com/cdn/shop/products/Charms-Sweet-Pops-Lollipops-Changemaker-48ct-CandyStore-com-969_2048x.jpg?v=1677669153",
        "price": 21.99,
        "desc": ""
    },
    "42688378798267": {
        "id": "42688378798267",
        "name": "Sugar Daddy Caramel Pops - Large - 24ct",
        "prod_url": "https://www.candystore.com/products/sugar-daddy-caramel-pops-large",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sugar-Daddy-Caramel-Pops-Large-24ct-CandyStore-com-599_2048x.jpg?v=1677177887",
        "price": 62.99,
        "desc": "Chewy Sugar Daddy caramel pops offer the best of everything when it comes to sweet snacking. These mouthwatering delights produce big flavor that no caramel fanatic can resist! The beauty is in the taste and the design. Each piece includes a generous bar of creamy caramel candy perched atop a convenient disposable stick. Simply peel the bright yellow wrapper and enjoy golden caramel confection to your heart's content without the gooey mess!Anytime is a great time to buy Sugar Daddy candy! Give them away during holidays, hide them in party favors or keep them around the pantry for days when you're craving something smooth and sweet. Since 1925, Sugar Daddies have been the go-to candy for caramel lovers. New sizes have been introduced over the years, but none compare to the large Sugar Daddy caramel pop. Take your mouth on a saccharine vacation with a box of nostalgic Sugar Daddy candies!"
    },
    "42688883785915": {
        "id": "42688883785915",
        "name": "Marvel Avengers Pop-Ups Lollipops Toys - 6ct",
        "prod_url": "https://www.candystore.com/products/avengers-pop-ups-lollipops",
        "img_url": "https://www.candystore.com/cdn/shop/products/Marvel-Avengers-Pop-Ups-Lollipops-Toys-6ct-CandyStore-com-438_2048x.jpg?v=1677157474",
        "price": 31.99,
        "desc": "Keep your Chupa Chup lollipops in a fun Avenger toy! Inspired by the Marvel Avengers movie, these lollipop holder toys will house your lollipop and protect it for you. Just push it up to start enjoying your pop! Includes 3 flavors of iconic Chupa Chups lollipops."
    },
    "42688745078971": {
        "id": "42688745078971",
        "name": "Lolly Box Mega Double - 24ct",
        "prod_url": "https://www.candystore.com/products/lolly-box-mega-double",
        "img_url": "https://www.candystore.com/cdn/shop/products/Lolly-Box-Mega-Double-24ct-CandyStore-com-771_2048x.jpg?v=1677154961",
        "price": 21.99,
        "desc": "Go big AND go home with this Lolly Box Mega Double mix! With traditional Smarties candies turned into lollipops and then stacked on top of one another, you'll have double the flavor and color in every bite!Having a big birthday party this year? Celebrating another big occasion? Why not get a candy that speaks to the magnitude of the event? With these Lolly Box Mega Double candies, you won't have to worry about coming up short with your delicious statement. Use these as gift bag stuffers, add some as centerpieces in a candy bouquet, put some out on a dessert table as a non traditional treat. The sky is the limit with how you enjoy these Lolly Box Mega Double candies!"
    },
    "42690591981755": {
        "id": "42690591981755",
        "name": "Pop Rocks Strawberry Candy - 24ct",
        "prod_url": "https://www.candystore.com/products/pop-rocks-strawberry",
        "img_url": "https://www.candystore.com/cdn/shop/products/Pop-Rocks-Strawberry-0-33oz-24ct-CandyStore-com-368_2048x.jpg?v=1677166862",
        "price": 25.49,
        "desc": "Pop Rocks Strawberry 0. 33oz - 24ct"
    },
    "42688745046203": {
        "id": "42688745046203",
        "name": "Wrapped Smarties Pops - 9lb",
        "prod_url": "https://www.candystore.com/products/smarties-pops-wrapped",
        "img_url": "https://www.candystore.com/cdn/shop/products/Wrapped-Smarties-Pops-9lb-CandyStore-com-878_2048x.jpg?v=1677186342",
        "price": 66.99,
        "desc": "If you ever wished Smarties were bigger, then consider it granted with these Smarties Pops Wrapped Jars! With traditional Smarties candy sized up to lollipop standards and put on a stick, you can munch and crunch on these classic candies in a whole new way. If you like to mix things up in your candy routine, try these Smarties Pops Wrapped Jars! You can keep them around the kitchen for when you want a sweet snack or to reward a bookworm for a great test grade. You can even order some Smarties Pops Wrapped Jars to sell at concessions stands for school sporting events or give out in goodie bags at parties. Just be smart and order some of these luscious lollipops today!"
    },
    "42690592145595": {
        "id": "42690592145595",
        "name": "Pop Rocks Watermelon Candy - 24ct",
        "prod_url": "https://www.candystore.com/products/pop-rocks-watermelon",
        "img_url": "https://www.candystore.com/cdn/shop/products/Pop-Rocks-Watermelon-0-33oz-48ct-CandyStore-com-459_2048x.jpg?v=1677166871",
        "price": 25.49,
        "desc": "Pop Rocks Watermelon 0. 33oz - 48ct"
    },
    "42689313439931": {
        "id": "42689313439931",
        "name": "Pop Ups Paw Patrol Lollipop 1.26oz Blister Pack - 6ct",
        "prod_url": "https://www.candystore.com/products/pop-ups-paw-patrol-lollipop-1-26oz-blister-pack",
        "img_url": "https://www.candystore.com/cdn/shop/products/Pop-Ups-Paw-Patrol-Lollipop-1-26oz-Blister-Pack-6ct-CandyStore-com-265_2048x.jpg?v=1677167176",
        "price": 32.99,
        "desc": "Pop Ups Paw Patrol Lollipop 1.26oz Blister Pack - 6ct"
    }
}