{
    "42688407896251": {
        "id": "42688407896251",
        "name": "Haribo Gummi Gold Bears Mini Bags - 54ct Tub",
        "prod_url": "https://www.candystore.com/products/haribo-gummi-gold-bears-mini-bags-tub",
        "img_url": "https://www.candystore.com/cdn/shop/products/Haribo-Gummi-Gold-Bears-Mini-Bags-54ct-Tub-CandyStore-com-153_2048x.jpg?v=1677143412",
        "price": 23.99,
        "desc": "We sure think that these gummies are ''tastier than the average bear!'' That's because these classic Haribo Gold Gummi Bears are here in a bulk bag to bring you even more of the delicious flavors you love. In a selection of red, orange, yellow, green, and white, everyone in your family will find a cub to love. Sprinkle a few in Jell-O for a ''beary'' good surprise, add some to a make your own sundae bar, or wrap some up for a loved one to make their day extra special. Haribo first made their chewy debut in 1922 in Germany with the creation of the famous Gummi Bear. "
    },
    "42688772800699": {
        "id": "42688772800699",
        "name": "Zotz 6 Flavors Assorted - 5lb",
        "prod_url": "https://www.candystore.com/products/zotz-6-flavors-assorted-bulk-candy",
        "img_url": "https://www.candystore.com/cdn/shop/products/Zotz-6-Flavors-Assorted-5lb-CandyStore-com-426_2048x.jpg?v=1677186980",
        "price": 52.99,
        "desc": "Zotz power candy will invigorate your taste buds with a sour and sweet fizzy combination! Each piece comes individually wrapped in blue, green, orange, pink, or purple packaging. Tear one open and enjoy hard candy with an extra bite! As soon as it touches your tongue, Zotz creates a fizzing sensation thanks to a powder coating. This Italian-made retro candy is a fun snack for kids and adults!"
    },
    "42688385417403": {
        "id": "42688385417403",
        "name": "Gummi Mini Burgers - 60ct Box",
        "prod_url": "https://www.candystore.com/products/gummi-mini-burgers-box",
        "img_url": "https://www.candystore.com/cdn/shop/products/Gummi-Mini-Burgers-60ct-Box-CandyStore-com-85_2048x.jpg?v=1677142173",
        "price": 19.99,
        "desc": "It should be considered a crime to throw a party without having Gummi Mini Burgers to hand out. They are fun, flavorful, affordable, and the perfect representation of one of the most popular all-American foods. Plus, they are a hit with folks of all ages. Pass out these little gummy burgers at your child's next slumber party, and everyone will be nominating you for the \"Parent of the Year\" award. Gummi Mini Burgers are everything you love in a gummy candy, only served up in an unconventional and totally fun way. Everyone serves gummi worms and bears at their party. Outshine them with these delicious candies. You can even dissect them to create special orders. Would you like extra pickles?"
    },
    "42688417464507": {
        "id": "42688417464507",
        "name": "Hershey's Minis Assorted Miniature Chocolate Bars - 6.25lb",
        "prod_url": "https://www.candystore.com/products/hersheys-mini-chocolate-candy-bars",
        "img_url": "https://www.candystore.com/cdn/shop/products/Hershey-s-Minis-Assorted-Miniature-Chocolate-Bars-6-25lb-CandyStore-com-801_2048x.jpg?v=1677145120",
        "price": 69.99,
        "desc": "Good things come in small packages. But they can certainly come in big ones too! And this bulk assortment of Hershey's Milk Chocolate, Hershey's Dark Chocolate, Mr. Goodbar, and Krackel mini candy bars is definitely an example of a very good thing. Founded in 1894, Hershey has been pumping out delicious candy bars long before any of us were around to enjoy them. That's why with their time-tested quality and handcrafted taste, you'll be snacking happily for a long time. And now with this bulk bag, you'll be able to get your entire family's favorite candy bars in one package."
    },
    "42690198765755": {
        "id": "42690198765755",
        "name": "Mini York Peppermint Patties Candy - 5.25lb",
        "prod_url": "https://www.candystore.com/products/york-mini-peppermint-patties",
        "img_url": "https://www.candystore.com/cdn/shop/products/york-mini-peppermint-patties-1q23-wmark_2048x.jpg?v=1677495931",
        "price": 41.99,
        "desc": "York Mini Peppermint Patties - 5.25lb"
    },
    "42688376406203": {
        "id": "42688376406203",
        "name": "Swedish Fish Red Mini - 5lb",
        "prod_url": "https://www.candystore.com/products/swedish-fish-red-mini",
        "img_url": "https://www.candystore.com/cdn/shop/products/Swedish-Fish-Red-Mini-5lb-CandyStore-com-643_2048x.jpg?v=1677179598",
        "price": 28.99,
        "desc": "They may be the size of sardines, but these Swedish Fish Red Minis have a punch of cherry burst that rivals some of the biggest fish in the sea. The original flavor and shape of their brand, these little swimmers have swam their way into the hearts and stomachs of thousands of candy lovers. With a soft, chewy bite and gummy center, they've quickly become the biggest fish in the pond and a beloved candy staple for people around the world. Dive into this bulk bag of Swedish Fish Red Minis and ''sea'' for yourself what all the fuss is about. "
    },
    "42688823361723": {
        "id": "42688823361723",
        "name": "Krabby Patty Giant Size - 36ct",
        "prod_url": "https://www.candystore.com/products/krabby-patty-giant-size",
        "img_url": "https://www.candystore.com/cdn/shop/products/Krabby-Patty-Giant-Size-36ct-CandyStore-com-336_2048x.jpg?v=1677151846",
        "price": 29.99,
        "desc": "Krabby Patty Giant Size - 36ct"
    },
    "42688746487995": {
        "id": "42688746487995",
        "name": "Mini Reese's Peanut Butter Cups Candy - 6.25lb Bulk",
        "prod_url": "https://www.candystore.com/products/mini-reeses-peanut-butter-cups",
        "img_url": "https://www.candystore.com/cdn/shop/products/mini-reeses-peanut-butter-cups-1q23-wmark_2048x.jpg?v=1678387700",
        "price": 74.99,
        "desc": "Our Mini Reese's Peanut Butter Cups may be small, but they come in a huge bulk order that you can munch on until your mouth gets tired. In tiny little foil wrappers, these pint size Mini Reese's Peanut Butter Cups have the same delicious peanut butter center and melty milk chocolate exterior, but only require one bite to gobble them down!Trick-or-treaters will absolutely love you if you stock your Halloween candy bowl with some Mini Reese's Peanut Butter Cups. These amazing candies also go great in candy buffet bars, baked into cookies, sprinkled on top of ice cream sundaes and eaten all on their own. Order some Mini Reese's Peanut Butter Cups today and you'll be in for treat after treat."
    },
    "42688353632443": {
        "id": "42688353632443",
        "name": "Unicorn Pops Mini - 48ct",
        "prod_url": "https://www.candystore.com/products/unicorn-pops-mini",
        "img_url": "https://www.candystore.com/cdn/shop/products/Unicorn-Pops-Mini-48ct-CandyStore-com-585_2048x.jpg?v=1677183929",
        "price": 49.99,
        "desc": "Just the sight of these hard-candied Unicorn Pops Mini lollipops can sweeten any soiree. Use them for a prize at a birthday party, or make a bouquet of them for wedding centerpieces. Since each one of these 6-inch Unicorn Pops Mini are individually wrapped they are also easy to stash in your purse, and kids of all ages will be excited to receive them at Halloween. Shaped just like the spiraling horn of folklore's most adored mystical animal, Unicorn Pops Mini suckers are as delicious as they are pretty. A rainbow of brilliant colors swirl tightly to create the look of the legendary horns said to have magical and medicinal properties. If only real medicine tasted this good!"
    },
    "42688741376187": {
        "id": "42688741376187",
        "name": "Charleston Chew Vanilla Box - 96ct",
        "prod_url": "https://www.candystore.com/products/charleston-chew-vanilla-box",
        "img_url": "https://www.candystore.com/cdn/shop/products/Charleston-Chew-Vanilla-Box-96ct-CandyStore-com-778_2048x.jpg?v=1677126924",
        "price": 41.99,
        "desc": "Enjoy your favorite classic candy bar in a new size with our convenient Charleston Chew vanilla box! Everyone remembers the smooth, delicious taste of a full size Charleston Chew. This candy bar was created in the 1920s and was named for the dance which was extremely popular at the time. Each full sized candy bar consisted of a vanilla taffy center surrounded by smooth chocolate. Now you can enjoy that same combination of taffy and chocolate in a bite-sized confection! Our Charleston Chew box contains classic vanilla in a smaller bar. Each comes individually wrapped in bright yellow with the famous logo printed on top. Miniature candy bars are perfect for quick snacking or special events. Use them as rewards or prizes in school activities or community events. They also fit nicely inside treat bags for birthday parties or DIY wedding favors. Enjoy the Charleston Chews you've always loved in a new mini candy bar size!"
    },
    "42688741769403": {
        "id": "42688741769403",
        "name": "Junior Mints Candy Mini Packs - 72ct",
        "prod_url": "https://www.candystore.com/products/junior-mints-mini-packs",
        "img_url": "https://www.candystore.com/cdn/shop/products/junior-mints-mini-packs-1q23-wmark_2048x.jpg?v=1677494580",
        "price": 36.99,
        "desc": "Junior Mints are a refreshing candy that's perfect for chocolate lovers. This popular candy includes a smooth mint center that's soft and chewy. The outside is encased in a thin layer of delectable dark chocolate for a rich flavor that's absolutely irresistible!Our bulk Junior Mints include convenient mini packs, which offer the same bite-sized morsels in smaller portions that are perfect for sharing, parties and quick snacking. The first Junior Mints were sold in 1949. Their name was developed as a play on the Junior Miss story collection that was penned by Sally Benson and published in The New Yorker. Today, the Junior Mint is a hugely popular confection. More than 15 million are produced each day! That's a lot of deliciousness for the world to enjoy. Our bulk Junior Mints mini packs include smaller boxes that fit easily into party favors, wedding favors, Christmas stockings and gift baskets!"
    },
    "42689736638651": {
        "id": "42689736638651",
        "name": "Twix Mini Bars Candy - 20lb Bulk",
        "prod_url": "https://www.candystore.com/products/twix-mini-bars",
        "img_url": "https://www.candystore.com/cdn/shop/products/twix-mini-bars-1q23-wmark_2048x.jpg?v=1677495789",
        "price": 228.99,
        "desc": "Twix Mini candy bars are sweet, crunchy and sure to satisfy even the most demanding cravings! Hugely popular Twix mini candy bars with a crisp biscuit center that's topped in smooth caramel smothered in an irresistible blanked of rich milk chocolate. \r\n\r\nBuy Mini Twix bars in bulk."
    },
    "42690856714427": {
        "id": "42690856714427",
        "name": "Mini Mini Chicles Fruit Gum - 20ct",
        "prod_url": "https://www.candystore.com/products/mini-mini-chicles-fruit-gum",
        "img_url": "https://www.candystore.com/cdn/shop/products/Mini-Mini-Chicles-Fruit-Gum-0-79oz-240ct-CandyStore-com-603_2048x.jpg?v=1677160157",
        "price": 23.99,
        "desc": "Mini Mini Chicles Fruit Gum 0. 79oz - 240ct"
    },
    "42688926220475": {
        "id": "42688926220475",
        "name": "Swiss Petite Fruits Candies by Koppers - 5lb",
        "prod_url": "https://www.candystore.com/products/koppers-mini-swiss-fruits",
        "img_url": "https://www.candystore.com/cdn/shop/products/Swiss-Petite-Fruits-from-Koppers-5lb-CandyStore-com-160_2048x.jpg?v=1677180084",
        "price": 64.99,
        "desc": "Swiss petite fruits candy is a classic in Europe. Mini fruit candies taste amazing! Colorful candy with realistic designs look great in any candy dish."
    },
    "42688356581563": {
        "id": "42688356581563",
        "name": "Fruit Slices Mini Assorted - 10lb",
        "prod_url": "https://www.candystore.com/products/fruit-slices-mini-assorted",
        "img_url": "https://www.candystore.com/cdn/shop/products/Fruit-Slices-Mini-Assorted-10lb-CandyStore-com-667_2048x.jpg?v=1677136794",
        "price": 74.99,
        "desc": "What they lack in size, they make up for in deliciousness! These assorted mini fruit slices are just as good as their grander versions and even cuter! That's because this bag of mini slices features a ton of different colors and flavors in a pint-sized form that you'll absolutely love. If you're a huge fan of gummy candy and fruity flavors, then these sugar coated fruit slices are going to blow you away. Bring some home to add to the top of a punch for a lovely surprise. Use a few to top a lemon or fruity flavored cupcake during the summertime. Even set out a bowl at your next backyard BBQ for everyone to enjoy. These Mini Assorted Fruit Slices can do it all and more!"
    },
    "42690199978171": {
        "id": "42690199978171",
        "name": "Tiny Pastel Jawbreakers - 10lb Bulk",
        "prod_url": "https://www.candystore.com/products/mini-pastel-jawbreakers",
        "img_url": "https://www.candystore.com/cdn/shop/products/Mini-Pastel-Jawbreakers-10lb-CandyStore-com-144_2048x.jpg?v=1677160146",
        "price": 49.99,
        "desc": "Mini Pastel Jawbreakers - 10lb"
    },
    "42688725778619": {
        "id": "42688725778619",
        "name": "Mini Gummi Worms Sugar Free - 5lb",
        "prod_url": "https://www.candystore.com/products/sugar-free-mini-gummi-worms",
        "img_url": "https://www.candystore.com/cdn/shop/products/sugar-free-mini-gummi-worms-1q23-wmark_2048x.jpg?v=1678387872",
        "price": 69.99,
        "desc": "Get your sweet fix and enjoy the fruity, juicy flavor of Albanese sugar free mini gummy worms! Gummy worms are a classic candy that has earned a large following. They were originally introduced to honor the 60th anniversary of the gummy bear. Even though they came later, many candy lovers prefer the long, wiggly shape that makes these long, wiggly worms so enticing. Albanese has created an irresistible gummy worm that's also better for your diet! Our sugar free mini gummy worms offer the fruit taste you love without the unnecessary sugar. Each package includes an assortment of popular flavors, including green apple, wild cherry, orange, lemon and pineapple. Satisfy your taste buds and stick to a low sugar diet. Sugar free gummies in bulk are a great choice for parties, events and classrooms. Educators can reward children without adding sugar to their daily diet while parents can offer an after school snack that's healthier. "
    }
}