{"42688407142587": {"id": "42688407142587", "name": "Goo Goo Clusters & Clusters Original Bars - 12ct", "prod_url": "https://www.candystore.com/products/goo-goo-clusters-clusters-supremes", "img_url": "https://www.candystore.com/cdn/shop/products/Goo-Goo-Clusters-Clusters-Original-12ct-CandyStore-com-654_2048x.jpg?v=1677140375", "price": 30.99, "desc": "Goo Goo Clusters are a savory-sweet candy bar that's sure to satisfy any sweet tooth. This amazing snack is packed with all the popular candy ingredients you love!Each serving is round with a disc shaped profile. The center includes a creamy marshmallow nougat alongside a layer of gooey caramel. The outside is smothered in a generous cluster of fresh roasted peanuts that are surrounded by a blanket of rich milk chocolate. You get a bit of everything each time you take a bite!Our bulk Goo Goo Clusters candy bars contain many individually wrapped bars that are convenient for sharing, gifting or snacking. Use them as Christmas stocking stuffers, put them in Easter baskets or add them to party favors. Goo Goo Clusters also make a delectable addition to your wedding favors! Supreme Goo Goo Clusters feature the same winning combination but replaces the roasted peanuts with savory pecans. "}, "42688597229755": {"id": "42688597229755", "name": "French Burnt Peanuts - 5lb", "prod_url": "https://www.candystore.com/products/french-burnt-peanuts", "img_url": "https://www.candystore.com/cdn/shop/products/French-Burnt-Peanuts-5lb-CandyStore-com-251_2048x.jpg?v=1677136130", "price": 36.99, "desc": "French burnt peanuts are candies that can be enjoyed by many. You will find that these peanuts are spikey and are coated with candy. This makes them great for those who want to have a movie night, a candy buffet, or even just for a snack. These candies are red in color and are sure to look great at any event or occasion that you decide to have them for. They taste amazing and almost anyone who loves peanuts is sure to find that they are happy with the taste and texture that they get from these. They come in a bulk bag so that you are sure to have enough to go around. After all once everyone gets a taste of this great candy they are sure to find that they want more. There is just something to be said about the great taste that you get from French burnt peanuts."}, "42688371589307": {"id": "42688371589307", "name": "Chick-O-Stick Nuggets - 5lb", "prod_url": "https://www.candystore.com/products/chick-o-sticks-nuggets", "img_url": "https://www.candystore.com/cdn/shop/products/Chick-O-Stick-Nuggets-5lb-CandyStore-com-118_2048x.jpg?v=1677669703", "price": 52.99, "desc": "Remember Chick-O-Sticks? Those delicious peanut butter candies with the coconut twist are back and better than ever. Now, instead of buying a full-sized Chick-O-Stick, you can get a bag of Chick-O-Sticks nuggets that will satisfy your sweet and savory cravings. Each nugget is about an inch long, the perfect size to just pop in your mouth and enjoy the sweet tastes while you go about your day. Pick up a big bulk bag today and start nibbling on one of your favorite candies again."}, "42688596508859": {"id": "42688596508859", "name": "Jumbo Boston Baked Beans Candy - 5lb", "prod_url": "https://www.candystore.com/products/jumbo-boston-baked-beans", "img_url": "https://www.candystore.com/cdn/shop/products/Jumbo-Boston-Baked-Beans-Candy-5lb-CandyStore-com-468_2048x.jpg?v=1677150278", "price": 31.99, "desc": "Jumbo Boston backed beans are a popular treat for candy lovers of all ages. This classic snack offers a unique blend of flavors that come together to create a taste experience like no other! Each piece includes high quality peanuts that are smothered in an irresistible red candy that provides an extra crunch with every bite. Eat them one at a time, by the handful or pour a bowl to enjoy when serious cravings hit! Our jumbo Boston baked beans are available in bulk packages! Larger quantities are perfect for special events, like birthdays, showers, weddings and holidays. Set them out at Christmas to go with festive decor or share them during summer picnics and indulge in the delightfully rich flavor of fresh peanuts. Friends and family will love sharing the savory taste while swapping tales of times past. Bulk Boston baked beans are also ideal for filling the office candy jar!"}, "42688602833083": {"id": "42688602833083", "name": "Boston Baked Beans Candy - 5lb", "prod_url": "https://www.candystore.com/products/boston-baked-beans", "img_url": "https://www.candystore.com/cdn/shop/products/Boston-Baked-Beans-Candy-5lb-CandyStore-com-743_2048x.jpg?v=1677665786", "price": 32.99, "desc": "At first look, a person may wonder how beans are candy but don't worry Boston Baked Beans aren't really beans at all. They get their name because of their unique shape but they are all candy and delightfully delicious. These candy covered peanuts have been associated with the great city of Boston since they were first introduced many years ago. They are red in color but the greatest thing about these treats is that they provide a crunchy delicious flavor to any occasion. The traditions Boston Baked Beans were always red, but in these modern times you can get these treats in a rainbow of colors - thought that option is temporarily unavailable. That means that you can find green ones for St. Patrick's Day or orange ones for Halloween. The Boston Baked Bean has been a very popular candy for over a hundred years and that is because all people love nuts covered in a candy coating."}, "42688623968443": {"id": "42688623968443", "name": "Chunky Bars - 24ct", "prod_url": "https://www.candystore.com/products/chunky-bars", "img_url": "https://www.candystore.com/cdn/shop/products/Chunky-Bars-24ct-CandyStore-com-479_2048x.jpg?v=1677129755", "price": 49.99, "desc": "Chunky bars are sure to satisfy even the most ravenous sweet tooth! This one-of-a-kind confection is rich, smooth and irresistible! Each individual bar includes four segments that can be enjoyed together or easily broken apart into bite-sized pieces. The distinctive trapezoid shape includes chewy California raisins resting among fresh roasted peanuts. Everything is smothered in creamy milk chocolate to form the solid bar that makes this a popular choice among many candy lovers. Nestle's Chunky bars are a great choice for any occasion. Order a bulk candy bar box to keep at home so you always have a snack to grab when you're on the go. Every bar is individually wrapped in handsome foil with the red ÒChunkyÓ logo emblazoned across the top. Our bulk Chunky bars are also an excellent choice for Halloween, treat bags, school events, community celebrations and much more! Satisfy a crowd with a nutty, rasin-y chocolate bar made by Nestle!"}, "42688414941371": {"id": "42688414941371", "name": "Hershey's Almond Milk Chocolate Bars - 36ct", "prod_url": "https://www.candystore.com/products/hersheys-milk-chocolate-almonds-bars", "img_url": "https://www.candystore.com/cdn/shop/products/Hershey-s-Almond-Milk-Chocolate-Bars-36ct-CandyStore-com-227_2048x.jpg?v=1677144856", "price": 75.99, "desc": "Do you like a candy bar that does double duty? Well these Hershey's Milk Chocolate with Almonds Bars are just the ticket to satisfy your advanced palate. With their milk chocolatey meltiness and crunchy bits of nutty almonds, these bars are a world-class treat that never ceases to please. And with 36 bars per display box, you'll have hours and hours of snacking ahead of you. Bring them to a party, put them in baked goods, or keep them around the house for happy snacking. In 1894, Hershey's opened their doors and began selling their now world-famous confections. With decades of success, we're positive that you'll love indulging in this famous brand."}, "42688414351547": {"id": "42688414351547", "name": "Payday Bars - 24ct", "prod_url": "https://www.candystore.com/products/payday-bars", "img_url": "https://www.candystore.com/cdn/shop/products/Payday-Bars-24ct-CandyStore-com-895_2048x.jpg?v=1677163592", "price": 49.99, "desc": "Cha-ching! The cash is rolling in with every bite of these delectable, crunchy Payday Bars. Filled with crunchy, whole peanuts and a delicious caramel nougat, it's no wonder why people around the world look forward to bite after bite of these rich treats. Introduced to candy bar loves for the first time in 1932, customers have been cashing in on these confections ever since! Bring some home to your candy bar and nut-lovers, spoil trick-or-treaters with a handful of these bars, or even crumble them into baked goods for an extra touch of yum! You'll feel like you struck it rich with every bite. "}, "42688628555963": {"id": "42688628555963", "name": "Goobers Theater Size - 15ct", "prod_url": "https://www.candystore.com/products/goobers-theater-size", "img_url": "https://www.candystore.com/cdn/shop/products/Goobers-Theater-Size-15ct-CandyStore-com-93_2048x.jpg?v=1677140394", "price": 38.99, "desc": "This classic movie candy is a star in its own right. And now you can bring the drama of the big screen home with you with this theater size box of Goobers! Featuring beloved Nestle milk chocolate covering whole roasted peanuts, these poppable palate pleasers have been a crowd favorite for years. Goobers is a nickname for southern peanuts and a natural name for these chocolate favorites. In 1925, these ground-dwelling nuts climbed to national fame when manufacturers began coating them in chocolate. So grab yourself a box, pop some popcorn, cuddle on the couch, and enjoy munching away while you make many movie nights to come extra special."}, "42689204322491": {"id": "42689204322491", "name": "Jordan Almonds White & Pastel - 7lb Bulk", "prod_url": "https://www.candystore.com/products/sconza-jordan-almonds-bulk", "img_url": "https://www.candystore.com/cdn/shop/products/Jordan-Almonds-White-Pastel-7lb-Bulk-CandyStore-com-978_2048x.jpg?v=1677149786", "price": 51.99, "desc": "Jordan almonds are a must-have favorite at weddings, showers and other important occasions. This classic confection is sometimes called a sugar almond because it consists of an almond which is sugar panned to create a delicious coating and pastel colors. While the Jordan almond may be a popular modern candy, its roots are believed to date as far back as Ancient Rome, where almonds were covered in honey and eaten during festivals. Our delicate Jordan almonds offer the delightful crunch and sweet candy coating in an assortment of gentle colors. You'll love grabbing a handful to find lavender, pink, white and minty green. Along with shower and wedding favors, our Jordan almonds are also ideal for serving at spring and Easter events. Guests will love the rich flavor and delectable crispness that comes with every bite. Our bulk Jordan almonds offer consistent quality in a candy you'll love to share!"}, "42689637646523": {"id": "42689637646523", "name": "Peanut Brittle - 5lb", "prod_url": "https://www.candystore.com/products/peanut-brittle", "img_url": "https://www.candystore.com/cdn/shop/products/Peanut-Brittle-5lb-CandyStore-com-315_2048x.jpg?v=1677164117", "price": 55.99, "desc": "Peanut Brittle - 5lb"}, "42688623771835": {"id": "42688623771835", "name": "Baby Ruth Bars - 24ct", "prod_url": "https://www.candystore.com/products/baby-ruth-bars", "img_url": "https://www.candystore.com/cdn/shop/products/Baby-Ruth-Bars-24ct-CandyStore-com-762_2048x.jpg?v=1677661412", "price": 42.99, "desc": "Oh, baby! This bambino of candy bars really hits it out of the park with the classic nougat, caramel, peanut, and chocolate combination that only Babe Ruth Candy Bars can concoct. Just as famous as its namesake, take this candy out to the ballgame, eat a few while watching sports on television at home, or just enjoy them as a tasty snack with legendary history. Babe Ruth was famed for a record amount of home runs. We think this candy is a home run in the chocolate world and you will too! With 24 per display box, that's a lot of hall of fame-worthy treats."}, "42688554991803": {"id": "42688554991803", "name": "Nut Roll Bars - 24ct", "prod_url": "https://www.candystore.com/products/nut-roll-bars", "img_url": "https://www.candystore.com/cdn/shop/products/Nut-Roll-Bars-24ct-CandyStore-com-129_2048x.gif?v=1677161922", "price": 52.99, "desc": "Salty. Crunchy. Sweet. These Nut Roll Bars have it all! Coated in creamy, chewy nougat with whole peanuts to munch on, these candy bars are a favorite among nut fanatics and sweet and salty lovers, alike! They're great for a sweet tooth or as a protein packed snack. Bring them on a hike for a big dose of energy, treat your close friends and family with these for a different dessert, or even crumble them up into baking recipes you love. With 24 candy bars per box, you'll go ''nuts'' with all of the deliciousness you'll have to snack on. "}, "42727131381947": {"id": "42727131381947", "name": "White Jordan Almonds -7lb Bulk", "prod_url": "https://www.candystore.com/products/white-jordan-almonds-sconza", "img_url": "https://www.candystore.com/cdn/shop/products/White-Jordan-Almonds-7lb-Bulk-CandyStore-com-467_2048x.jpg?v=1677185703", "price": 59.99, "desc": "White Jordan almonds are a must-have favorite at Easter and also at Springtime weddings, showers and other important occasions. A delightful crunch and sweet candy coating in an assortment of gentle colors."}, "42690186838203": {"id": "42690186838203", "name": "Boston Baked Beans Preprice 0.8oz Box - 24ct", "prod_url": "https://www.candystore.com/products/boston-baked-beans-preprice-08oz-box", "img_url": "https://www.candystore.com/cdn/shop/products/Boston-Baked-Beans-Preprice-0-8oz-Box-24ct-CandyStore-com-173_2048x.jpg?v=1677124843", "price": 21.99, "desc": "Boston Baked Beans Preprice 0.8oz Box - 24ct"}, "42688770343099": {"id": "42688770343099", "name": "Milk Chocolate Panned Peanuts - 10lb", "prod_url": "https://www.candystore.com/products/milk-chocolate-panned-peanuts", "img_url": "https://www.candystore.com/cdn/shop/products/Milk-Chocolate-Panned-Peanuts-10lb-CandyStore-com-228_2048x.jpg?v=1677158888", "price": 58.99, "desc": "Milk chocolate panned peanuts offer two flavors you love with a smoother texture! This process involves a fresh peanut that's placed inside a drum. The drum rotates, causing the peanut to tumble while a mist of sweet milk chocolate is applied. The constant motion produces an even covering with a luxuriously smooth exterior. You'll love the savory-sweet taste packed into every milk chocolate panned peanut!"}, "42688414384315": {"id": "42688414384315", "name": "Take 5 Candy Bars - 18ct", "prod_url": "https://www.candystore.com/products/take-five-candy-bars", "img_url": "https://www.candystore.com/cdn/shop/products/Take-5-Candy-Bars-18ct-CandyStore-com-560_2048x.png?v=1677180510", "price": 41.99, "desc": "Take 5 candy bars are a big hit. The middle of these have peanuts and pretzels that have been dipped in peanut butter followed by caramel. People love the way that these taste and they are great when you find that you are craving something sweet. You will find that these are also great when it comes to finding a candy that you want to pass out at Halloween. It is then coated using milk chocolate. Your mouth is probably watering already and it should be, because there is just something about these that make you want more. You will find that it has a nice soft texture but it is also crunchy. This means that you are able to get the best of both worlds with this candy bar. Not to even mention the fact that you will get a little bit of sweet and salty taste as well."}, "42688496468155": {"id": "42688496468155", "name": "Snickers Almond Bars - 24ct", "prod_url": "https://www.candystore.com/products/snickers-almond-bars", "img_url": "https://www.candystore.com/cdn/shop/products/Snickers-Almond-Bars-24ct-CandyStore-com-863_2048x.gif?v=1677175047", "price": 57.99, "desc": "Just when we thought Snickers couldn't possibly get any better, they had to go and blow our minds by inventing these Snickers Almond Bars. Are you ready to explode your definition of delicious and bite down into one of these incredible treats?Then order yourself a bulk supply of the almond version of the best candy bar today and get ready for an amazing surprise. These bars are coated in melty chocolate and stuffed with enough nougat, creamy caramel and almonds to keep your mouth munching happily for a long, long time. If you're big into candy bars or baking, order some of these Snickers Almond Bars and break them over the top of cookies, cupcakes and even ice cream sundaes. Or just eat a candy bar whenever you need a complex textural adventure in amazing candy. "}, "42690337243323": {"id": "42690337243323", "name": "Pecan Supreme Mix Bazzini 2oz Peg Bags - 12ct", "prod_url": "https://www.candystore.com/products/bazzini-pecan-supreme-2oz-peg-bags", "img_url": "https://www.candystore.com/cdn/shop/products/Bazzini-Pecan-Supreme-2oz-Peg-Bags-12ct-CandyStore-com-257_2048x.jpg?v=1677121775", "price": 19.99, "desc": "Bazzini Pecan Supreme 2oz Peg Bags - 12ct"}, "42689484751035": {"id": "42689484751035", "name": "Dark Chocolate Peanuts - 10lb", "prod_url": "https://www.candystore.com/products/dark-chocolate-peanuts", "img_url": "https://www.candystore.com/cdn/shop/products/Dark-Chocolate-Peanuts-10lb-CandyStore-com-343_2048x.jpg?v=1677133121", "price": 61.99, "desc": "Dark Chocolate Peanuts - 10lb"}, "42688747307195": {"id": "42688747307195", "name": "Hershey's Milk Chocolate Bar With Almonds King Size - 18ct", "prod_url": "https://www.candystore.com/products/hershey-milk-chocolate-bar-with-almonds-king-size", "img_url": "https://www.candystore.com/cdn/shop/products/Hershey-s-Milk-Chocolate-Bar-With-Almonds-King-Size-18ct-CandyStore-com-473_2048x.jpg?v=1677144977", "price": 69.99, "desc": "If this candy bar is king, then the almonds must be the crown jewels! These King Size Hershey's Milk Chocolate Bar With Almonds are true royalty of the candy world with their melty milk chocolate and sophisticated almond pieces. For chocolate and almond lovers, these King Size Hershey's Milk Chocolate Bar With Almonds are a no brainer. Not only will you have a bulk order of these delicious ingredients, but they'll also come in enormous king size bars. You'll be able to break them up and sprinkle them into baked goods, shave off some pieces to make the top of a cake extra pretty and yummy or just eat them on their own. Order some King Size Hershey's Milk Chocolate Bar With Almonds today and you'll be more than satisfied."}}