{
    "42688625967291": {
        "id": "42688625967291",
        "name": "Fun Dip Single Packs - 48ct",
        "prod_url": "https://www.candystore.com/products/fun-dip-small-packs",
        "img_url": "https://www.candystore.com/cdn/shop/products/Fun-Dip-Single-Packs-48ct-CandyStore-com-693_2048x.jpg?v=1677136948",
        "price": 20.99,
        "desc": "Fun Dip candy is truly one-of-a-kind! This tasty creation includes packets of sugary powder with an edible stick! Just lick the stick, dip it in the powder and enjoy the fruity flavor. Fun Dip makes snack time so much more exciting! Our bulk candy box is great for anyone with children. Keep a pack on hand so you are always ready to serve up an irresistible treat at snack time or save a few for yourself because you're never too old for Fun Dip!Our bulk Fun Dip box contains two delightful flavors. Try classic cherry or mouthwatering razzapple. Each packet includes its own stick so you don't have to use your hands! Fun Dip was originally created as Lik-M-Aid in the 1940s. While the name and design has changed throughout the decades, it still remains one of the most popular confections among candy lovers. Order your Fun Dip bulk box today and enjoy the irresistible flavors of a candy that's fun to eat!"
    },
    "42689314914491": {
        "id": "42689314914491",
        "name": "Powder Filled Plastic Fruits 0.2oz - 72ct",
        "prod_url": "https://www.candystore.com/products/powder-filled-plastic-fruits",
        "img_url": "https://www.candystore.com/cdn/shop/products/Powder-Filled-Plastic-Fruits-0-2oz-72ct-CandyStore-com-555_2048x.jpg?v=1677167396",
        "price": 26.99,
        "desc": "Powder Filled Plastic Fruits 0.2oz - 72ct"
    },
    "42688625868987": {
        "id": "42688625868987",
        "name": "Fun Dip 3-Flavor Packs - 24ct",
        "prod_url": "https://www.candystore.com/products/fun-dip-large-packs",
        "img_url": "https://www.candystore.com/cdn/shop/products/Fun-Dip-3-Flavor-Packs-24ct-CandyStore-com-570_2048x.jpg?v=1677136805",
        "price": 49.99,
        "desc": "Fun Dip is a one-of-a-kind candy that kids absolutely love! This unique treat isn't like other confections. It all started in the 1930s when a fruit drink mix called Fruzola was introduced. While the powder was meant to be used to make a beverage, kids found that it's tangy and sweet taste also made a great snack! Seeing the popularity of Fruzola, candy makers began producing Like-M-Aid that would eventually become the Fun Dip we love today. Fun Dip comes in an assortment of delicious fruit flavors. Each pouch contains a serving of the powder candy as well as an edible stick! Lick the stick then dip it in the powder to enjoy both at the same time. Our bulk Fun Dip packs contain many pouches that are perfect for parties and school events. Give Fun Dip out as prizes at carnivals or use them as an easy after school snack for the kids!"
    },
    "42688380305595": {
        "id": "42688380305595",
        "name": "Fluffy Stuff Cotton Candy 2.5oz - 24ct",
        "prod_url": "https://www.candystore.com/products/fluffy-stuff-cotton-candy-bags",
        "img_url": "https://www.candystore.com/cdn/shop/products/Fluffy-Stuff-Cotton-Candy-2-5oz-24ct-CandyStore-com-308_2048x.jpg?v=1677135864",
        "price": 54.99,
        "desc": "Fluffy Stuff cotton candy from Charms. No candy store is complete without a selection of light, fluffy, and sweet cotton candy. It has come to be trademark of the summer fun and sweetness and you do not want to miss out on it! Available in sweet flavors, our cotton candy will bring smiles to the faces of all who enjoy it and everyone who craves that melt in your mouth sensation . Our specially packaged bulk order will give you 12 bags of 25 ounce cotton candy ready to be displayed and ready to sell. Give your customers what they are looking for and make sure to include some of our cotton candy on your next order!"
    }
}