{
    "42689206059195": {
        "id": "42689206059195",
        "name": "Gourmet Salt Water Taffy - Bulk",
        "prod_url": "https://www.candystore.com/products/salt-water-taffy-flavors",
        "img_url": "https://www.candystore.com/cdn/shop/products/Gourmet-Salt-Water-Taffy-5lb-CandyStore-com-768_2048x.jpg?v=1677140500",
        "price": 19.99,
        "desc": "No one can resist the smooth texture and mouthwatering flavor of classic saltwater taffy! This nostalgic delight emerged from Atlantic City, NJ to become one of the most popular confections in the world. Often used in wedding favors or given as a special gift, saltwater taffy is sure to please any sweet tooth! Each individually wrapped piece includes rich molasses, sea salt and palm oil to produce that creamy taste experience that has everyone reaching for a second piece, or even a third and fourth!Saltwater taffy comes in a long list of delicious flavors, each featuring its own unique color. The many pastel hues, like yellow, pink and orange, harken back to this candy's seaside origins. You'll love sampling each distinct flavor, like caramel swirl or root beer float! Nothings better than a stroll along the boardwalk with watermelon or raspberry saltwater taffy. Explore our flavor list today and discover your new favorite beach snack!\r\n\r\nChoose from over 60 different flavors or mixes. When all flavors and mixes are available, there are more than 60 to choose from. The Assorted Taffy mix contains about 15 flavors."
    },
    "42688376078523": {
        "id": "42688376078523",
        "name": "Sour Patch Kids Assorted - 5lb",
        "prod_url": "https://www.candystore.com/products/sour-patch-kids",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sour-Patch-Kids-Assorted-5lb-CandyStore-com-920_2048x.jpg?v=1677175842",
        "price": 28.99,
        "desc": "You'll be puckering up for a long, long time with this bulk bag of Sour Patch Kids. With a tart, sugary bite followed by a sweet reprieve, it's no wonder why they're one of America's favorite candies. First sour and then sweet these little trouble makers will wreak havoc on your mouth in the most delicious way possible. In green lime, lemon yellow, orange, and red raspberry, there's a flavor for every sour-lover. Bring them to a sporting event for a tasty snack or try them in a glass of lemonade. With hours of tartness in every pack, you'll be all puckered out!"
    },
    "42726972195003": {
        "id": "42726972195003",
        "name": "Assorted Salt Water Taffy Mix - 5lb",
        "prod_url": "https://www.candystore.com/products/salt-water-taffy-assorted",
        "img_url": "https://www.candystore.com/cdn/shop/products/Assorted-Salt-Water-Taffy-Mix-5lb-CandyStore-com-64_2048x.jpg?v=1677661058",
        "price": 24.99,
        "desc": "Assorted salt water taffy mix. Do you remember those amazing trips to the beach with your family when you were a kid? Vacation was never complete without a trip to the candy store and a big bag of salt water taffy. Bring those great memories to life in your mouth any time you like with these assorted salt water taffy candies. Set them out in a candy dish at home or work and share the sweet experience."
    },
    "42688393183419": {
        "id": "42688393183419",
        "name": "Caramel Candy Squares - 5lb",
        "prod_url": "https://www.candystore.com/products/caramel-squares-wrapped",
        "img_url": "https://www.candystore.com/cdn/shop/products/Caramel-Candy-Squares-5lb-CandyStore-com-43_2048x.jpg?v=1677668249",
        "price": 27.99,
        "desc": "Don't be such a square! Unless you want to be a delicious, creamy Caramel Square. These tawny, creamy cubes are amazing little morsels that will melt away in your mouth and leave a smile on your face. Individually wrapped in clear cellophane, they make a great addition to a candy buffet bar, as a candy dish go-to, or even to keep around the house and melt into hot chocolate and baked goods. Caramel has been around for centuries and transforms typical granulated sugar into this famous form of ooey, gooey chewiness when heated at a high heat. We'd like give the culinary geniuses who came up with this fantastic candy a pat on the back!"
    },
    "44600714199227": {
        "id": "44600714199227",
        "name": "Fruit Slices Candy - 5lb",
        "prod_url": "https://www.candystore.com/products/fruit-slices-candy",
        "img_url": "https://www.candystore.com/cdn/shop/products/Fruit-Slices-Candy-5lb-CandyStore-com-707_2048x.jpg?v=1677136391",
        "price": 39.99,
        "desc": "Fruit slices gummies are a fabulous treat that comes in many exciting flavors! If you love chewy gummy candy but want more options when it comes to taste, this is a must-try. Our delicious fruit slices candy include a flat wedge shape slab of confection with a flat end and curved side. A white line runs along the curved edge, creating the look of a fruit rind. Every fruit slice is different based on its flavor. Grape is all purple while black cherry includes a red middle with blue \"rind\". We carry a huge variety of juicy flavors that also include lemon lime, cherry, strawberry banana, orange, pink grapefruit, peach, watermelon, sour apple, red raspberry and blue raspberry. If you can't decide on just one, you can instead choose our amazing assorted bulk fruit slices pack! This mouthwatering blend contains a little bit of everything so you can sample all your chewy favorites!"
    },
    "42688573341883": {
        "id": "42688573341883",
        "name": "Chocolate Caramel Squares Candy - 5lb Bulk",
        "prod_url": "https://www.candystore.com/products/chocolate-caramel-squares",
        "img_url": "https://www.candystore.com/cdn/shop/products/Chocolate-Caramel-Squares-Candy-5lb-Bulk-CandyStore-com-250_2048x.jpg?v=1677670342",
        "price": 36.99,
        "desc": "We love that these Chocolate Caramel Squares Candies come wrapped in cellophane so we can see right through to the deliciousness! And why would anyone want to cover up a candy that features a delicious milk chocolate square of amazingness and a melty, chewy caramel center inside?Are you a major proponent for Chocolate Caramel Square Candies? Then you've hit the jackpot here on CandyStore. com because we have tehm in bulk at budget friendly prices. This means you can bring home hundreds of these Chocolate Caramel Square Candies to chow down on for weeks to come. Or however long your sweet tooth allows."
    },
    "42688407929019": {
        "id": "42688407929019",
        "name": "Haribo Gummi Gold Bears - 5lb",
        "prod_url": "https://www.candystore.com/products/haribo-gold-gummi-bears",
        "img_url": "https://www.candystore.com/cdn/shop/products/Haribo-Gummi-Gold-Bears-5lb-CandyStore-com-969_2048x.jpg?v=1677143433",
        "price": 35.99,
        "desc": "Silly old bear. These classic Haribo Gold Gummi Bears are here in a bulk bag to bring you even more of the tasty flavors you love. In a selection of red, orange, yellow, green, and white, everyone in your family will find a cub to love. Sprinkle a few in Jell-O for a ''beary'' good surprise, add some to a make your own sundae bar, or wrap some up for a loved one to make their day extra special. Haribo first made their chewy debut in 1922 in Germany with the creation of the famous Gummi Bear. See for yourself why they earned the slogan, ''Kids and grown-ups love it so n the happy world of Haribo!'' "
    },
    "42688376668347": {
        "id": "42688376668347",
        "name": "Sour Patch Watermelon Slices - 5lb",
        "prod_url": "https://www.candystore.com/products/watermelon-slices",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sour-Patch-Watermelon-Slices-5lb-CandyStore-com-660_2048x.jpg?v=1677175970",
        "price": 28.99,
        "desc": "Sour Patch Watermelon Slices look like tiny, sugar-dusted pieces of watermelon. Their pink and green coloring makes them perfect to put out at any pink-themed party. They'll make a great addition to a bachelorette party or baby shower. They're also a perfect pick for Valentine's, as their sour taste is sure to make your guests pucker up! You can get these deliciously tart chewy watermelon candies in a big bulk bag, but don't let the size fool you. They'll be gone before you know it. "
    },
    "42726992380091": {
        "id": "42726992380091",
        "name": "Peppermint Salt Water Taffy - 2.5lb",
        "prod_url": "https://www.candystore.com/products/peppermint-salt-water-taffy",
        "img_url": "https://www.candystore.com/cdn/shop/products/Peppermint-Salt-Water-Taffy-2-5lb-CandyStore-com-517_2048x.png?v=1677165083",
        "price": 15.99,
        "desc": "When days at the beach get hot, you can do more than jumping in the waves for a cool-down. Try our refreshing Peppermint Salt Water Taffy to beat the heat. The individually wrapped morsels make them ideal to pack in a beach bag or cooler. Discovered in the late 1800s, salt water taffy was the product of an unfortunate event. When a candy store owner's shop was flooded with sea water, he decided to market his soaked taffys to the public! What a happy accident this incident turned out to be, because people have incorporated taffy into their summer snacks and memories for generations."
    },
    "42726973833403": {
        "id": "42726973833403",
        "name": "Banana Salt Water Taffy - 2.5lb",
        "prod_url": "https://www.candystore.com/products/banana-salt-water-taffy",
        "img_url": "https://www.candystore.com/cdn/shop/products/Banana-Salt-Water-Taffy-2-5lb-CandyStore-com-468_2048x.png?v=1677662138",
        "price": 17.99,
        "desc": "If you love to visit the zoo then this is the perfect candy for you to enjoy. This Banana Salt Water Taffy has such a real banana flavor that each and even monkeys can be fooled about their authenticity. Salt water taffy is going to make you feel great about yourself anyway, because it provides a person with a bit of nostalgia. There is no other treat which screams about summer more than salt water taffy. This sweet banana taste is going to make eating one of these treats an impossibility but no need to worry as they come in a hefty bulk bag. That should be enough to keep you munching for hours. The real banana taste is going to make you want to visit the local zoo, because you will want to share them with all the other primates. Candy is always best when it is shared with someone who appreciates it and primates of all ages will absolutely love this!"
    },
    "42726972719291": {
        "id": "42726972719291",
        "name": "Tropical Assorted Salt Water Taffy - 5lb",
        "prod_url": "https://www.candystore.com/products/tropical-salt-water-taffy-assorted",
        "img_url": "https://www.candystore.com/cdn/shop/products/Tropical-Assorted-Salt-Water-Taffy-5lb-CandyStore-com-371_2048x.jpg?v=1677182871",
        "price": 24.99,
        "desc": "This seashore classic is now heading to the tropics with these Assorted Tropical Salt Water Taffies! Feel the sun on your face, the wind in your hair, and hear the crash of the ocean waves with every bite of these colorful taffies. Around since the late 1800s, the history is almost as sweet as the candy itself. When the tides turned and flooded a candy store owner's shop, he decided to market his salt water soaked taffys to the public! We're sure glad the sea found this taffy and so are the generations of people that have enjoyed it since."
    },
    "42726984220859": {
        "id": "42726984220859",
        "name": "Cinnamon Swirl Salt Water Taffy - 2.5lb",
        "prod_url": "https://www.candystore.com/products/cinnamon-salt-water-taffy",
        "img_url": "https://www.candystore.com/cdn/shop/products/Cinnamon-Swirl-Salt-Water-Taffy-2-5lb-CandyStore-com-537_2048x.png?v=1677130344",
        "price": 15.99,
        "desc": "If you have never tried cinnamon salt water taffy then you don't know what you are missing out on. The flavor of these is perfect. They have a cinnamon blend that is spicy and works just right with the sweet flavor that they have as well. There is nothing better than the tasty of salt water taffy and when you combine it with cinnamon the flavor really seems to explode. The candies are pink in color and are sure to look great for a many different occasions. You will also like to know that each piece is wrapped individually which is very helpful in making sure that they stay fresh as long as possible. There is just something about the chewy texture of taffy that is able to please so many people. This is a great tasting candy with a great texture that is hard to beat."
    },
    "42688612991163": {
        "id": "42688612991163",
        "name": "Sassy Taffy - 5lb",
        "prod_url": "https://www.candystore.com/products/sassy-taffy-salt-water-taffy",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sassy-Taffy-5lb-CandyStore-com-34_2048x.png?v=1677173501",
        "price": 26.99,
        "desc": "Me. Ow. These Sassy Salt Water Taffies have enough sweet and sour spunk to knock you back to last Tuesday! In a colorful mix of blue, yellow, orange, green, red, and purple these saucy salt water taffies make a bold addition to a pinata, party favor bags, and candy stashes. Individually wrapped, enjoy them one at a time or take your chances on upping the ante by enjoying them by the mouthful! Their sweet, fruity taste combined with a sour punch will satisfy even the most daring candy lovers. But be careful because the more you eat, the sassier you may become. "
    },
    "42726998606011": {
        "id": "42726998606011",
        "name": "Strawberry Salt Water Taffy - 2.5lb",
        "prod_url": "https://www.candystore.com/products/strawberry-salt-water-taffy",
        "img_url": "https://www.candystore.com/cdn/shop/products/Strawberry-Salt-Water-Taffy-2-5lb-CandyStore-com-46_2048x.png?v=1677178003",
        "price": 15.99,
        "desc": "What happens when you combine creamy saltwater taffy with the juicy flavor of ripe red strawberries? You get one of the most mouthwatering confections found on land or in the sea! Saltwater taffy is a classic treat that hails from the sundrenched boardwalks of Atlantic City, NJ. This classic confection has been around for decades and has become a popular souvenir at many seaside destinations. Our strawberry saltwater taffy is easy to get because you don't have to go on vacation to buy it!The blend of molasses, sea salt and strawberry flavorings gives our saltwater taffy an irresistibly soft, smooth taste. Every piece is individually wrapped so you can easily separate servings for snacking or place a few in a party or wedding favor! The gentle pink taffy color includes deep red stripes around the sides that make this treat perfect for Valentine's Day, anniversaries or any special occasion that celebrates love!"
    },
    "42726983270587": {
        "id": "42726983270587",
        "name": "Chocolate Salt Water Taffy - 2.5lb",
        "prod_url": "https://www.candystore.com/products/chocolate-salt-water-taffy",
        "img_url": "https://www.candystore.com/cdn/shop/products/Chocolate-Salt-Water-Taffy-2-5lb-CandyStore-com-569_2048x.png?v=1677128987",
        "price": 15.99,
        "desc": "What's all the fuss about? ''Sea'' for yourself with these amazingly creamy and delectable Chocolate Salt Water Taffies. Hit the sand with every bite of these individually wrapped morsels. Surprise your chocolate-loving family with a bag of these. Even drop a few into your hot cocoa for extra chocolatey goodness. Around since the late 1800s, the history is almost as sweet as the candy itself. When the tides turned and flooded a candy store owner's shop, he decided to market his salt water soaked taffys to the public! We're sure glad the sea found this taffy and so are the generations of people that have enjoyed it since."
    },
    "42688376307899": {
        "id": "42688376307899",
        "name": "Swedish Fish Red - 5lb",
        "prod_url": "https://www.candystore.com/products/swedish-fish-red",
        "img_url": "https://www.candystore.com/cdn/shop/products/Swedish-Fish-Red-5lb-CandyStore-com-447_2048x.jpg?v=1677179595",
        "price": 28.99,
        "desc": "It's not polite to fish for compliments. But these gilled little gummies just can't help themselves! With their bright, cherry flavor and craveable chewiness, Swedish fish have swam their way out of the sea into the hearts of millions. The original flavor and shape of their brand, these little swimmers have inspired the Swedish Fish AquaLife variety as well as Assorted colors and flavors. They've quickly become the biggest fish in the pond and are a beloved candy staple for people around the world. Dive into this bulk bag and ''sea'' for yourself what all the fuss is about. "
    },
    "42688618627259": {
        "id": "42688618627259",
        "name": "Orange Slices Candy - 15lb",
        "prod_url": "https://www.candystore.com/products/orange-slices-candy",
        "img_url": "https://www.candystore.com/cdn/shop/products/Orange-Slices-Candy-15lb-CandyStore-com-175_2048x.jpg?v=1677162697",
        "price": 52.99,
        "desc": "At last! We've finally found a delicious chewy candy that does grow on trees! These Orange Slices Candy have all the yummy flavor of fresh squeezed oranges and are a beautiful treat to look at. Coated in sugar with a bright, orange color, these gummies are a refreshing and sweet burst that will please any candy fan. Bring some to a beach party for a summery, festive treat, add some to a punch bowl to add a burst of bright color and sweet flavor, or even wrap some up in a gift bag for a fruity surprise. Orange you glad we told you about these sweet treats?Approximately 32 pieces per pound"
    },
    "42688668008635": {
        "id": "42688668008635",
        "name": "Goetze's Caramel Creams Bulls Eyes - 10lb",
        "prod_url": "https://www.candystore.com/products/bulls-eyes-caramel-creams",
        "img_url": "https://www.candystore.com/cdn/shop/products/Goetze-s-Caramel-Creams-Bulls-Eyes-10lb-CandyStore-com-939_2048x.jpg?v=1677139916",
        "price": 46.99,
        "desc": "Each Caramel Cream (or Bull's Eye), starts with a white cream filling at the center. The outside includes a generous layer of high quality caramel to create a round treat. Our bulk Caramel Creams arrive individually wrapped with nostalgic red Goetze branding. Caramel Cream Bulls Eyes are the crowning jewel in the Goetze's catalog. The Goetze brand goes way back to 1895. By 1917, the family-owned company introduced its first soft caramel candies, much to the delight of candy lovers!Today, Caramel Creams are considered Goetze's signature creation, and it's easy to see why once you sink your teeth into one! Keep them in the candy jar at home, take them to the office to share or add to a gourmet gift basket! Caramel Creams are also a wonderful choice for shower and wedding favors. Their sweet, creamy taste and classic look appeals to candy lovers of all ages! Find out what makes Goetze so delicious by adding Caramel Creams to your next gathering. "
    },
    "42688434864315": {
        "id": "42688434864315",
        "name": "Sunkist Fruit Gems - 10lb",
        "prod_url": "https://www.candystore.com/products/sunkist-fruit-gems-bulk",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sunkist-Fruit-Gems-10lb-CandyStore-com-825_2048x.jpg?v=1677179082",
        "price": 79.99,
        "desc": "Get ready for a big, sugary smooch with these Sunkist Fruit Gems! Their delicious, gummy chew and bright, fruity flavor will make you want to pucker up for more every time you take a bite. Individually wrapped, these little gummies pack the power of the sun into every chew and show off the beautiful colors of the rainbow. Stock yourself up with some rainy day sunshine with a bag of these. They're a great goodie bag stuffer for birthday parties, look lovely at a summertime picnic on the dessert table, and even can be kept to cheer up your little ones on a rainy day. With 42 pieces per pound, there are enough to please every gummy fan!"
    },
    "42688432308411": {
        "id": "42688432308411",
        "name": "Candy Corn - 10lb Bulk",
        "prod_url": "https://www.candystore.com/products/candy-corn-30lb",
        "img_url": "https://www.candystore.com/cdn/shop/products/Candy-Corn-10lb-Bulk-CandyStore-com-65_2048x.jpg?v=1677667785",
        "price": 49.99,
        "desc": "What autumn event would be complete without colorful candy corn?! Our bulk candy corn is the perfect choice for any fall celebration or holiday. Whether it's Halloween, Thanksgiving or a special event you're hosting for the season, our chewy pieces will make guests smile. Each cone shaped confection feature the classic striped pattern everyone recognizes in bright yellow, rich orange and gentle white. Just pour into a glass jar or festive bowl and serve! Our high quality candy corn is also convenient for use in autumn craft projects and school events. Use them to create beautiful cakes that feature scarecrows, pumpkins, witches or any other popular fall character. Slip a handful into a treat bag to give away during festivals, trick or treat night or the classroom Halloween party. With a combination of honey, salt and sugar, our irresistible candy corn will get everyone in the mood to celebrate the season!"
    },
    "42726990839995": {
        "id": "42726990839995",
        "name": "Orange Creme Salt Water Taffy - 2.5lb",
        "prod_url": "https://www.candystore.com/products/orange-creme-salt-water-taffy",
        "img_url": "https://www.candystore.com/cdn/shop/products/Orange-Creme-Salt-Water-Taffy-2-5lb-CandyStore-com-567_2048x.png?v=1677162557",
        "price": 17.99,
        "desc": "You can almost feel the fresh salty breeze in your hair and hear the roaring of the waves hitting the beach with every bite of these Orange Creme Salt Water Taffies. Their beautiful orange and white swirls will remind you of summer and melt away in your mouth every time you snack. Around since the late 1800s, the history is almost as sweet as the candy itself. When the tides turned and flooded a candy store owner's shop, he decided to market his salt water soaked taffys to the public! We're sure glad the sea found this taffy and so are the generations of people that have enjoyed it since."
    },
    "42726981468347": {
        "id": "42726981468347",
        "name": "Cherry Salt Water Taffy - 2.5lb",
        "prod_url": "https://www.candystore.com/products/cherry-salt-water-taffy",
        "img_url": "https://www.candystore.com/cdn/shop/products/Cherry-Salt-Water-Taffy-2-5lb-CandyStore-com-924_2048x.png?v=1677669380",
        "price": 15.99,
        "desc": "Cherry salt water taffy is sure to take you back to your childhood vacations to the beach. These red and pink chewy candies will be a huge hit anywhere you take them. Put them out in a candy dish at home, or take them to share the sweet taffy goodness at work or at a party. Cherry salt water taffy makes a great addition to a Valentine's Day gift bag."
    },
    "42726975766715": {
        "id": "42726975766715",
        "name": "Caramel Apple Salt Water Taffy - 2.5lb",
        "prod_url": "https://www.candystore.com/products/caramel-apple-salt-water-taffy",
        "img_url": "https://www.candystore.com/cdn/shop/products/Caramel-Apple-Salt-Water-Taffy-2-5lb-CandyStore-com-950_2048x.png?v=1677668338",
        "price": 15.99,
        "desc": "One classic confection with the flavor of another: it is a novelty with the appeal of a tradition! Caramel Apple Salt Water Taffy has a bright green center that looks bright as springtime when you use it as a table scatter or to fill an heirloom dish.A symbol of playful days and sunny summers by the sea, bulk saltwater taffy is beloved by kids and adults for its soft, chewy, flavorful composition, and the individual wrappers on these green and brown taffy delicacies make them perfect for candy buffets, treat bags, and pantry stockpiles of tasty sweets.The tart green apple flavor in this wholesale caramel apple taffy combines with a creamy, sweet caramel taste that is reminiscent of the original molasses recipe from which modern taffy flavors evolved. Apple flavor, too, takes your taste buds straight to the autumn orchards, too. The combination of classic taste appeals makes caramel apple saltwater taffy an especially evocative little treat!"
    },
    "42726999294139": {
        "id": "42726999294139",
        "name": "Sugar Free Salt Water Taffy Lite - 5lb",
        "prod_url": "https://www.candystore.com/products/sugar-free-salt-water-taffy-lite",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sugar-Free-Salt-Water-Taffy-Lite-5lb-CandyStore-com-78_2048x.png?v=1677178758",
        "price": 38.99,
        "desc": "Summertime and the living's easy. And now, sugar free! Try these Sugar Free Salt Water Taffy Lites for a healthier fix of the boardwalk classic and all the scrumptious taste of the original recipe. In blue-raspberry, strawberry, lemon, chocolate, orange, and vanilla, let these little morsels melt away as you remember digging your toes into the sand and letting the sun shine in your hair. Around since the late 1800s, the history is almost as sweet as the candy itself. When the tides turned and flooded a candy store owner's shop, he decided to market his salt water soaked taffys to the public! We're sure glad the sea found this taffy and so are the generations of people that have enjoyed it since."
    }
}