{
    "42689090519227": {
        "id": "42689090519227",
        "name": "Sour Balls Hard Candy - 7lb",
        "prod_url": "https://www.candystore.com/products/sour-balls",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sour-Balls-Hard-Candy-7lb-CandyStore-com-80_2048x.jpg?v=1677175355",
        "price": 24.99,
        "desc": "Sour hard candy balls in assorted flavors! Red cherry, yellow lemon, green lime and orange sour candy balls individually wrapped and super fun."
    },
    "42688608239803": {
        "id": "42688608239803",
        "name": "Assorted Fruit Sours Candy Balls - 5lb",
        "prod_url": "https://www.candystore.com/products/fruit-sours-candy-balls-assorted",
        "img_url": "https://www.candystore.com/cdn/shop/products/Assorted-Fruit-Sours-Candy-Balls-5lb-CandyStore-com-271_2048x.jpg?v=1677660478",
        "price": 37.99,
        "desc": "Holy Moly! These tart Assorted Fruit Sours Candies deliver an unrelenting pucker with delicious, fruity flavor. In sour apple, lemon, tangerine, grape, and cherry, there's a flavor for everyone. Bring some to a birthday party, add some to a lemonade for a sour, fruity flavor addition and pretty garnish, or keep them around the house when you're in the mood for a feisty snack. One of the sourest candies to grace the mouths of many, these little pucker-packed candies will please every sour candy lover. Their rainbow of beautiful, bright colors may look unsuspecting, but get ready for a dose of tartness that will thrill your taste buds!"
    },
    "42688376078523": {
        "id": "42688376078523",
        "name": "Sour Patch Kids Assorted - 5lb",
        "prod_url": "https://www.candystore.com/products/sour-patch-kids",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sour-Patch-Kids-Assorted-5lb-CandyStore-com-920_2048x.jpg?v=1677175842",
        "price": 28.99,
        "desc": "You'll be puckering up for a long, long time with this bulk bag of Sour Patch Kids. With a tart, sugary bite followed by a sweet reprieve, it's no wonder why they're one of America's favorite candies. First sour and then sweet these little trouble makers will wreak havoc on your mouth in the most delicious way possible. In green lime, lemon yellow, orange, and red raspberry, there's a flavor for every sour-lover. Bring them to a sporting event for a tasty snack or try them in a glass of lemonade. With hours of tartness in every pack, you'll be all puckered out!"
    },
    "42688609288379": {
        "id": "42688609288379",
        "name": "Red Cherry Fruit Sours Candy Balls - 5lb",
        "prod_url": "https://www.candystore.com/products/red-cherry-fruit-sours-candy-balls",
        "img_url": "https://www.candystore.com/cdn/shop/products/Red-Cherry-Fruit-Sours-Candy-Balls-5lb-CandyStore-com-997_2048x.jpg?v=1677170381",
        "price": 37.99,
        "desc": "Red cherry fruit sours candy is a great addition to any holiday spread. Let's face it; red goes with almost any occasion. It's the perfect color addition to Valentine's Day, Christmas, the Fourth of July, and it even works for a  bloody  element to Halloween. Red cherry fruit sours explode in your mouth with tartness and sweetness. These delicious candies are sure to be a hit with all your sour-loving friends at your next party. "
    },
    "42688356286651": {
        "id": "42688356286651",
        "name": "Gummy Sour Inch Worms Candy - 5lb",
        "prod_url": "https://www.candystore.com/products/sour-inch-worms",
        "img_url": "https://www.candystore.com/cdn/shop/products/Gummy-Sour-Inch-Worms-Candy-5lb-CandyStore-com-885_2048x.jpg?v=1677142747",
        "price": 24.99,
        "desc": "These little gummy worms are cute and come in colors that are vibrant. They are a sour flavored gummy that is sure to please. Some of the colors that you can expect to see are red and yellow, blue and orange, and even green and yellow. These worms would be great to add on ice cream or to use at any party or gathering, as they are able to please both adults and children. You will also find that these will work great for Halloween. If you are looking for a candy that provides you with flavor and a bit of kick then this is just what you have been looking for. You can get a big bulk bag of these wonderful gummy worms that will be enough to allow many to take part in them. They are each one inch in size which is the perfect bite size so that you can eat a whole one at one time. "
    },
    "42688382402747": {
        "id": "42688382402747",
        "name": "Sour Gummi Peach Hearts - 6.6lb",
        "prod_url": "https://www.candystore.com/products/sour-gummi-peach-hearts",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sour-Gummi-Peach-Hearts-6-6lb-CandyStore-com-9_2048x.jpg?v=1677175531",
        "price": 48.99,
        "desc": "Sour gummy hearts are available now in succulent peach! There's something irresistible about the smooth, chewy texture of high quality gummies combined with the sweet taste of fresh fruit. Now you can get your chewy, fruity fix whenever you need it with our sour peach gummies!This irresistible treat arrives in a fun heart shape. One half is a rich gold color while the other is bold red, much like the skin of a ripe peach! Sweet gummies are great, but sometimes you need a little more bite with your candy. The adventurous confection connoisseur will love the sour sugar coating that covers all sides of each peach heart. Every bite is an experiment in sweet, sour and peach! The heart shape is perfect for Valentine's Day or can be given in decorative gift bags or boxes as wedding favors. Remember to buy plenty because everyone will want to try your sour peach gummy hearts!"
    },
    "42688394002619": {
        "id": "42688394002619",
        "name": "Claey's Lemon Drops - 10lb",
        "prod_url": "https://www.candystore.com/products/lemon-drops-unwrapped",
        "img_url": "https://www.candystore.com/cdn/shop/products/290_2048x.jpg?v=1678464536",
        "price": 46.99,
        "desc": "Taste buds, get ready for a sweet and sour surprise that will make you pucker and smile. These little Lemon Drops are coated with a tart, crystalized sugar that will make your mouth and eyes water and beg for the sweet reprieve of the candy's sugary center. Have a summertime picnic coming up that you'd like to add a sweet and sour treat to? Want to punch up the pucker power of punches and lemonades? Have a little birthday boy or girl who is having a yellow themed party? These yellow little wonders can do it all and more. "
    },
    "42688632619195": {
        "id": "42688632619195",
        "name": "Skittles Sour Candy Share Size - 24ct",
        "prod_url": "https://www.candystore.com/products/skittles-sour-king-size",
        "img_url": "https://www.candystore.com/cdn/shop/products/skittles-sour-king-size-1q23-wmark_2048x.jpg?v=1677495494",
        "price": 84.99,
        "desc": "Woah. You're moving on up from the lightweight candy category into the heavy weights! The question is, are you ready for the mighty size of these Skittles Sour King-Size? If so, then get ready to put on a pretty pucker for some time to come because these little specks of Skittles also pack a tart punch!Coated in crystalized sour sugar, your face will squish and your eyes will tear up as soon as one hits your tongue. But don't worry, you'll finish the fight with these King Size Skittles Sours with a win because the sour will turn into the fruity and sweet flavor Skittles are known for. Bring some home today and treat your taste buds to a sour match!"
    },
    "42689244627131": {
        "id": "42689244627131",
        "name": "Sour Prosecco Flavored Gummy Bears - 6.6lb",
        "prod_url": "https://www.candystore.com/products/sour-prosecco-flavored-gummy-bears",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sour-Prosecco-Flavored-Gummy-Bears-6-6lb-CandyStore-com-440_2048x.jpg?v=1677176435",
        "price": 38.99,
        "desc": "Sour Prosecco Flavored Gummy Bears - 6.6lb"
    },
    "42688381550779": {
        "id": "42688381550779",
        "name": "Gummi Sour Cherry Cola Bottles - 6.6lb",
        "prod_url": "https://www.candystore.com/products/gummi-sour-cherry-cola-bottles",
        "img_url": "https://www.candystore.com/cdn/shop/products/Gummi-Sour-Cherry-Cola-Bottles-6-6lb-CandyStore-com-832_2048x.jpg?v=1677142424",
        "price": 43.99,
        "desc": "These Sour Cherry Cola Bottle Gummies are just so stinkin', cheek-pinchin' cute that we can't contain ourselves! That's because these ''pint'' sized treats are a perfect gummy replication of a cherry cola classic. Doused in a coating of crystally sugar, these gummies are packed with the traditional sour Cherry Coke taste. Bring them to a party to please cola and candy lovers, alike! Save some to put in a candy jar on the refreshment table at your next backyard picnic. Even make up cute little bags of these gummies to give away to friends. We're sure you'll ''drink'' in the deliciousness of these favorite gummies."
    },
    "42688772800699": {
        "id": "42688772800699",
        "name": "Zotz 6 Flavors Assorted - 5lb",
        "prod_url": "https://www.candystore.com/products/zotz-6-flavors-assorted-bulk-candy",
        "img_url": "https://www.candystore.com/cdn/shop/products/Zotz-6-Flavors-Assorted-5lb-CandyStore-com-426_2048x.jpg?v=1677186980",
        "price": 52.99,
        "desc": "Zotz power candy will invigorate your taste buds with a sour and sweet fizzy combination! Each piece comes individually wrapped in blue, green, orange, pink, or purple packaging. Tear one open and enjoy hard candy with an extra bite! As soon as it touches your tongue, Zotz creates a fizzing sensation thanks to a powder coating. This Italian-made retro candy is a fun snack for kids and adults!"
    },
    "42688376668347": {
        "id": "42688376668347",
        "name": "Sour Patch Watermelon Slices - 5lb",
        "prod_url": "https://www.candystore.com/products/watermelon-slices",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sour-Patch-Watermelon-Slices-5lb-CandyStore-com-660_2048x.jpg?v=1677175970",
        "price": 28.99,
        "desc": "Sour Patch Watermelon Slices look like tiny, sugar-dusted pieces of watermelon. Their pink and green coloring makes them perfect to put out at any pink-themed party. They'll make a great addition to a bachelorette party or baby shower. They're also a perfect pick for Valentine's, as their sour taste is sure to make your guests pucker up! You can get these deliciously tart chewy watermelon candies in a big bulk bag, but don't let the size fool you. They'll be gone before you know it. "
    },
    "42688618823867": {
        "id": "42688618823867",
        "name": "Sour Gummy Bears - 5lb Bulk",
        "prod_url": "https://www.candystore.com/products/ferrara-pan-sour-gummy-bears",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sour-Gummy-Bears-5lb-Bulk-CandyStore-com-175_2048x.jpg?v=1677175673",
        "price": 29.99,
        "desc": "We cant help but wonder what these Sour Gummy Bears got into that made them so tangy! They certainly haven't been eating honey like Pooh or berries in the forest like their cousin the black bear. Whatever the case, these little Sour Gummy Bears are seriously pucker-worthy!If you're a fan of other sour candy, then give these chewy little bears a try. Coated in tart sugar and in a multitude of colors, you can munch, nibble, chew and suck on these little morsels until the cows come home. Just do long as your taste buds can hold out long enough to handle the tang, you'll be good to go with one of these bulk bags."
    },
    "42727073611963": {
        "id": "42727073611963",
        "name": "Sour Apple Candy Sticks - 80ct",
        "prod_url": "https://www.candystore.com/products/sour-apple-candy-sticks",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sour-Apple-Candy-Sticks-80ct-CandyStore-com-993_2048x.jpg?v=1677175395",
        "price": 28.99,
        "desc": "Sour apple candy sticks are an old time favorite that kids and adults will enjoy. This classic candy starts with a tube of hard confection. Every inch is packed with mouth puckering sour apple flavor in dark green with a white double stripe. Ours arrive individually packaged in the nostalgic Gilliam wrapper so you know you’re getting the best! Our sour apple candy sticks are a great choice for party favors and casual snacking."
    },
    "42688517210299": {
        "id": "42688517210299",
        "name": "Gummi Sour Stars - 6.6lb",
        "prod_url": "https://www.candystore.com/products/gummi-sour-stars",
        "img_url": "https://www.candystore.com/cdn/shop/products/Gummi-Sour-Stars-6-6lb-CandyStore-com-707_2048x.jpg?v=1677142471",
        "price": 48.99,
        "desc": "Gummy sour stars and moons are fun, colorful and absolutely out of this world! You'll love every bite even more when you see enchanting five point stars, scalloped suns, comets and crescent moons. Each chewy piece is made using high quality gummy candy in many brilliant hues, including yellow, orange, red and blue. It's like having the entire universe in your pantry! Make themed parties, holidays and other events even more memorable by handing out these tasty tidbits. They look dazzling in a glass dish or jar. Pour them into treat bags or give you beloved reception guests something sweet to enjoy by adding them to wedding favors. The fun astronomy inspired shapes are also gorgeous for decorating cakes, cookies and cupcakes or can be used to put the finishing touches on a gingerbread house!Our star gummies include a generous number of pieces so you have more than enough for picnics, events or whatever occasion you're celebrating!"
    },
    "42688436764859": {
        "id": "42688436764859",
        "name": "Green Apple Fruit Sours Candy Balls - 5lb",
        "prod_url": "https://www.candystore.com/products/green-apple-fruit-sours-candy-balls",
        "img_url": "https://www.candystore.com/cdn/shop/products/Green-Apple-Fruit-Sours-Candy-Balls-5lb-CandyStore-com-17_2048x.jpg?v=1677141374",
        "price": 37.99,
        "desc": "An apple a day may keep the doctor away. But a Green Apple Fruit Sours Candy Ball can keep you smiling all day! These delicious green apple sour candies are a delicious treat for any day of the week. Coated in a bright green candy shell and packed with a soft chewy candy center, every sour snacker will love these. Use them for a spring or summer themed event. Add them to a gingerbread house for an atypical flavor that still has the holiday green you love. Or even bring some to a birthday party for someone who loves sour candy and the color green! We're sure you'll feel better once you try these. "
    },
    "42688811925691": {
        "id": "42688811925691",
        "name": "Sour Jacks Watermelon - 5lb",
        "prod_url": "https://www.candystore.com/products/sour-jacks-watermelon",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sour-Jacks-Watermelon-5lb-CandyStore-com-427_2048x.jpg?v=1677175904",
        "price": 24.99,
        "desc": "Bursting with Sour Power, Sour Jacks watermelon candies are mouth-puckering good. Sour chewy old school gummies. Watermelon flavor sour chewy candies from back in the days where all the little boys wore beanies with propellers on their heads."
    },
    "42689244463291": {
        "id": "42689244463291",
        "name": "Sour Blastin' Blue Raspberry Flavored Gummy Bears - 6.6lb",
        "prod_url": "https://www.candystore.com/products/sour-blastin-blue-raspberry-flavored-gummy-bears",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sour-Blastin-Blue-Raspberry-Flavored-Gummy-Bears-6-6lb-CandyStore-com-220_2048x.jpg?v=1677175379",
        "price": 32.99,
        "desc": "Sour Blastin' Blue Raspberry Flavored Gummy Bears - 6.6lb"
    },
    "42689406795963": {
        "id": "42689406795963",
        "name": "Sour Sharks - 6.6lb",
        "prod_url": "https://www.candystore.com/products/sour-sharks",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sour-Sharks-6-6lb-CandyStore-com-135_2048x.jpg?v=1677176981",
        "price": 47.99,
        "desc": "Sour Sharks - 6.6lb"
    },
    "42690244706491": {
        "id": "42690244706491",
        "name": "Sour Gummy Piglets Candy - 4.4lb",
        "prod_url": "https://www.candystore.com/products/sour-gummy-piglets",
        "img_url": "https://www.candystore.com/cdn/shop/products/sour-gummy-piglets-1q23-wmark_2048x.jpg?v=1677495548",
        "price": 38.99,
        "desc": "Sour Gummy Piglets - 4.4lb"
    },
    "44507205140667": {
        "id": "44507205140667",
        "name": "Sour Power Mini Belts Snax Quattro - 19.8lb Bulk",
        "prod_url": "https://www.candystore.com/products/sour-power-mini-belts-snax-quattro",
        "img_url": "https://www.candystore.com/cdn/shop/products/sour-power-mini-belts-snax-quattro-1q23-wmark_2048x.jpg?v=1677495573",
        "price": 197.99,
        "desc": ""
    },
    "44507204255931": {
        "id": "44507204255931",
        "name": "Sour Gummy Loops Candy Multi-Color - 5lb",
        "prod_url": "https://www.candystore.com/products/sour-gummy-loops-candy-multi-color",
        "img_url": "https://www.candystore.com/cdn/shop/products/sour-gummy-loops-candy-multi-color-1q23-wmark_2048x.jpg?v=1677495546",
        "price": 25.99,
        "desc": ""
    },
    "42689920467131": {
        "id": "42689920467131",
        "name": "Sour Power Belts from Dorval - 19.8lb",
        "prod_url": "https://www.candystore.com/products/sour-power-belts-dorval-bulk",
        "img_url": "https://www.candystore.com/cdn/shop/products/sour-power-belts-cotton-candy-wmark_2048x.jpg?v=1647699970",
        "price": 119.99,
        "desc": "Dorval Sour Power belt gummies are a delicious treat for kids and the young at heart! Each piece consist of a long, wide ribbon of flat gummy candy in bright colors. Our flavor list includes all your favorites, like strawberry, watermelon, apple, berry and much more!Sour Power belt candy is a fun choice for birthday parties and holiday events. Our flavor options also make it easy to create your own custom candy assortment! Just order 2 or more packages to combine colors for any celebration. Add to kids treat bags or use as a unique accent on edible displays like gingerbread houses. Sour Power belts also give you more ways to decorate cakes, cupcakes and other baked goods. Our bulk Sour Power gummy belts give you many long pieces so you have enough to share with guests or enjoy at home! This classic candy has been satisfying sweet cravings since 1985."
    },
    "42689247346875": {
        "id": "42689247346875",
        "name": "Sour Ooze Tube Squeeze Pop 4oz - 12ct",
        "prod_url": "https://www.candystore.com/products/sour-ooze-tube-squeeze-pop",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sour-Ooze-Tube-Squeeze-Pop-4oz-12ct-CandyStore-com-265_2048x.jpg?v=1677175936",
        "price": 25.99,
        "desc": "Sour Ooze Tube Squeeze Pop 4oz - 12ct"
    }
}