{
    "42688771457211": {
        "id": "42688771457211",
        "name": "Sugar Free Gummi Bears Assorted - 6.6lb",
        "prod_url": "https://www.candystore.com/products/sugar-free-gummi-bears-assorted-wld-fruit",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sugar-Free-Gummi-Bears-Assorted-6-6lb-CandyStore-com-860_2048x.jpg?v=1677178182",
        "price": 74.99,
        "desc": "Sugar free gummi bears are the perfect way to enjoy your favorite childhood candy without all the unhealthy sugar. This version tastes delicious and includes an assortment of wild fruit flavors. Try pink, red, orange, yellow, white, or green. Each piece comes in the familiar teddy bear shape we know and love. Our bulk sugar free gummy bears is the best way to keep your favorite snack on hand!"
    },
    "42726999294139": {
        "id": "42726999294139",
        "name": "Sugar Free Salt Water Taffy Lite - 5lb",
        "prod_url": "https://www.candystore.com/products/sugar-free-salt-water-taffy-lite",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sugar-Free-Salt-Water-Taffy-Lite-5lb-CandyStore-com-78_2048x.png?v=1677178758",
        "price": 38.99,
        "desc": "Summertime and the living's easy. And now, sugar free! Try these Sugar Free Salt Water Taffy Lites for a healthier fix of the boardwalk classic and all the scrumptious taste of the original recipe. In blue-raspberry, strawberry, lemon, chocolate, orange, and vanilla, let these little morsels melt away as you remember digging your toes into the sand and letting the sun shine in your hair. Around since the late 1800s, the history is almost as sweet as the candy itself. When the tides turned and flooded a candy store owner's shop, he decided to market his salt water soaked taffys to the public! We're sure glad the sea found this taffy and so are the generations of people that have enjoyed it since."
    },
    "42688861077691": {
        "id": "42688861077691",
        "name": "Sugar Free Dark Chocolate Almond Bark - 6lb",
        "prod_url": "https://www.candystore.com/products/sugar-free-dark-chocolate-almond-bark",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sugar-Free-Dark-Chocolate-Almond-Bark-6lb-CandyStore-com-555_2048x.jpg?v=1677178044",
        "price": 117.99,
        "desc": "Sugar Free Dark Chocolate Almond Bark - 6lb"
    },
    "42688800915643": {
        "id": "42688800915643",
        "name": "Jelly Belly Sugar Free Assorted Jelly Beans - 12ct Bags",
        "prod_url": "https://www.candystore.com/products/jelly-belly-assorted-sugar-free-jelly-beans-bags",
        "img_url": "https://www.candystore.com/cdn/shop/products/jelly-belly-assorted-sugar-free-jelly-beans-bags-1q23-wmark_2048x.jpg?v=1677494503",
        "price": 36.99,
        "desc": "Jelly Belly makes it even easier to enjoy their famous jellybeans and stick to a sugar-free diet. This colorful assortment features all sugar-free jellybeans in your favorite flavors. Each piece includes the familiar coffee bean shape and smooth texture along with the authentic brand logo printed on the side. Splenda is added to the recipe to produce a sweet tasting bean without the added sugar. "
    },
    "42688725778619": {
        "id": "42688725778619",
        "name": "Mini Gummi Worms Sugar Free - 5lb",
        "prod_url": "https://www.candystore.com/products/sugar-free-mini-gummi-worms",
        "img_url": "https://www.candystore.com/cdn/shop/products/sugar-free-mini-gummi-worms-1q23-wmark_2048x.jpg?v=1678387872",
        "price": 69.99,
        "desc": "Get your sweet fix and enjoy the fruity, juicy flavor of Albanese sugar free mini gummy worms! Gummy worms are a classic candy that has earned a large following. They were originally introduced to honor the 60th anniversary of the gummy bear. Even though they came later, many candy lovers prefer the long, wiggly shape that makes these long, wiggly worms so enticing. Albanese has created an irresistible gummy worm that's also better for your diet! Our sugar free mini gummy worms offer the fruit taste you love without the unnecessary sugar. Each package includes an assortment of popular flavors, including green apple, wild cherry, orange, lemon and pineapple. Satisfy your taste buds and stick to a low sugar diet. Sugar free gummies in bulk are a great choice for parties, events and classrooms. Educators can reward children without adding sugar to their daily diet while parents can offer an after school snack that's healthier. "
    },
    "42689042350267": {
        "id": "42689042350267",
        "name": "Sugar Free Cherry Cordials - 6lb",
        "prod_url": "https://www.candystore.com/products/sugar-free-cherry-cordials",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sugar-Free-Cherry-Cordials-6lb-CandyStore-com-942_2048x.jpg?v=1677178100",
        "price": 144.99,
        "desc": "Sugar Free Cherry Cordials - 6lb"
    },
    "42688397639867": {
        "id": "42688397639867",
        "name": "Black Licorice Bears Sugar Free - 6.6lb",
        "prod_url": "https://www.candystore.com/products/black-licorice-bears-sugar-free",
        "img_url": "https://www.candystore.com/cdn/shop/products/Black-Licorice-Bears-Sugar-Free-6-6lb-CandyStore-com-197_2048x.jpg?v=1677664538",
        "price": 79.99,
        "desc": "Meet these delicious and sugar free black licorice gummy bears. Bears are a very attractive animal, kids love them and so do adults and edible bears are the absolute best kind of all. Much like the real bear roams through the wild. The Black Licorice Sugar Free Bears are going to be roving to and fro throughout the wilderness of your mind. Their taste is haunting and it is virtually impossible for any person to eat only one of these licorice treats, because they are so delicious. These treats are coming to you all the way from Holland, leave it to the Dutch to take licorice and turn it into something irresistible and undeniably delicious. These candies can be bought in bulk so that you will never have to worry about going bear free. The sugar free tasty goodness of the licorice bear can be yours all day long!"
    },
    "42688803209403": {
        "id": "42688803209403",
        "name": "Sugar Free Wrapped Jelly Belly 10-Flavor Twists - 5lb",
        "prod_url": "https://www.candystore.com/products/sugar-free-10-flavor-twists-jelly-belly",
        "img_url": "https://www.candystore.com/cdn/shop/products/Sugar-Free-Wrapped-Jelly-Belly-10-Flavor-Twists-5lb-CandyStore-com-303_2048x.jpg?v=1677178821",
        "price": 78.99,
        "desc": "Sugar free Jelly Belly Twist jelly beans are a great way to portion snack time and enjoy your favorite treat! Each piece includes the familiar shape and look you know and love, right down to the logo printed on the side. This assortment includes yellow, red, black, orange, green, and pink beans that arrive individually wrapped. Just twist one end, pop the bean in your mouth, and enjoy the taste of sugar free Jelly Belly!"
    },
    "42688366969019": {
        "id": "42688366969019",
        "name": "Red Vines Sugar Free Strawberry Licorice Vines - 12ct",
        "prod_url": "https://www.candystore.com/products/red-vines-sugar-free-strawberry-licorice-vines",
        "img_url": "https://www.candystore.com/cdn/shop/products/Red-Vines-Sugar-Free-Strawberry-Licorice-Vines-12ct-CandyStore-com-266_2048x.jpg?v=1677171019",
        "price": 51.99,
        "desc": "Sugar free Vines licorice is the best way to enjoy your favorite childhood treat! Everyone loves the smooth, chewy taste of classic licorice. It's been around for decades and has become a fast favorite among the young and young at heart. Our Red Vines licorice makes the experience even better because you can enjoy the same sweet strawberry taste with no fat so every snacking session is guilt-free! Each piece includes a length of irresistible red licorice with a juicy strawberry flavor. The vines include flat ends with a twisted design that runs from top to bottom, adding unique texture to every bite. Our bulk red licorice pack includes individual bags that are great for travel or sharing. Simply hide a bag of licorice wherever you need it so you always have a treat within reach. Tuck one in the glove box before a long car ride or stow red licorice in luggage so you have an easy snack while away from home!"
    },
    "42689594884283": {
        "id": "42689594884283",
        "name": "Jila Sugar Free Peppermint Mints Tin 1.2oz - 12ct",
        "prod_url": "https://www.candystore.com/products/jila-sugar-free-peppermint-mints-tin",
        "img_url": "https://www.candystore.com/cdn/shop/products/Jila-Sugar-Free-Peppermint-Mints-Tin-1-2oz-12ct-CandyStore-com-263_2048x.jpg?v=1677149556",
        "price": 67.99,
        "desc": "Jila Sugar Free Peppermint Mints Tin 1.2oz - 12ct"
    },
    "42690174976187": {
        "id": "42690174976187",
        "name": "Eda's Assorted Fruit Hard Sugar Free Candies - 15lb",
        "prod_url": "https://www.candystore.com/products/edas-sugar-free-assorted-fruit-hard-candies",
        "img_url": "https://www.candystore.com/cdn/shop/products/Eda-s-Sugar-Free-Assorted-Fruit-Hard-Candies-15lb-CandyStore-com-696_2048x.jpg?v=1677134862",
        "price": 104.99,
        "desc": "Eda's Sugar Free Assorted Fruit Hard Candies - 15lb"
    }
}