{
    "42688407634107": {
        "id": "42688407634107",
        "name": "Smooth & Melty Nonpareil Mint Chocolate Chips - 6.25lb",
        "prod_url": "https://www.candystore.com/products/petite-smooth-melty-nonpareil-mint-chocolate-chips",
        "img_url": "https://www.candystore.com/cdn/shop/products/Smooth-Melty-Nonpareil-Mint-Chocolate-Chips-6-25lb-CandyStore-com-487_2048x.jpg?v=1677174846",
        "price": 52.99,
        "desc": "Awww, these Smooth Melty Nonpareil Mint Chocolate Chips are just so cute, we can't stop looking at them or eating them! In pink, green, and yellow, these minty morsels dotted in white are the daintiest and prettiest confection you can add to any event. Add some to a table at a wedding for a pretty breath-freshener, bring some to a bridal or baby shower to show off their beautiful pastel hues, or even add these to baked goods in the springtime to represent the beautiful flowers in bloom. Nonpareils date back to the 18th century and were originally used to decorate wedding cakes. We're sure glad they're around today too, for everyone to enjoy!"
    },
    "42688417038523": {
        "id": "42688417038523",
        "name": "Reese's Pieces Candy - 6.25lb",
        "prod_url": "https://www.candystore.com/products/reeses-pieces-candy-bulk",
        "img_url": "https://www.candystore.com/cdn/shop/products/Reese-s-Pieces-Candy-6-25lb-CandyStore-com-894_2048x.jpg?v=1677171299",
        "price": 54.99,
        "desc": "Relish creamy peanut butter and a hard candy shell with every bite of Reese's Pieces candies! These classic confections are completely irresistible! Each package includes the classic orange, yellow and brown treats that are shaped like M&Ms but offer a completely unique peanut buttery flavor. When a whole peanut butter cup is just too much, grab a handful or our delicious Reese's Pieces!Any kid who was around during the 1980s will fondly recall this tasty treat. It was flying off the shelves after making an appearance in Steven Spielberg's classic film, E. T. the Extra-Terrestrial. Reese's Pieces candy has changed very little since then. Each bite still offers the same irresistible flavor and crunch that kids were loving over 30 years ago. Now you can enjoy this brand name favorite at parties, picnics, events or at home. Our bulk candy package contains more than enough Reese's Pieces candy to please a crowd!"
    },
    "42689555497147": {
        "id": "42689555497147",
        "name": "Guittard Vanilla A'Peels - 25lb",
        "prod_url": "https://www.candystore.com/products/guittard-vanilla-apeels",
        "img_url": "https://www.candystore.com/cdn/shop/products/Guittard-Vanilla-A-Peels-25lb-CandyStore-com-378_2048x.jpg?v=1677142129",
        "price": 147.99,
        "desc": "Guittard Vanilla A'Peels - 25lb"
    },
    "42688740524219": {
        "id": "42688740524219",
        "name": "Candy Pebbles - 5lb",
        "prod_url": "https://www.candystore.com/products/candy-pebbles-sweets",
        "img_url": "https://www.candystore.com/cdn/shop/products/Candy-Pebbles-5lb-CandyStore-com-472_2048x.jpg?v=1677667791",
        "price": 43.99,
        "desc": "Candy pebbles may look like little rocks, but they are actually packed with delicious flavor! These eye-caching candies look unique and offer a snacking experience that's completely unique. Grab one or a handful and taste each miniature stone. Every piece includes a different shape for a more natural appearance that almost looks like holding a handful of real pebbles!Along with an organic shape, our candy pebbles also feature a number of gorgeous colors. Try a red, purple, blue, gold or white. Each is covered in white or black speckles to recreate the look of the real thing. Candy pebble are a great alternative to chocolate rocks. Pour in a bowl and serve as a simple snack or use them to create unique party favors. You can even use them to fill your wedding favors or incorporate them into your holiday festivities! From cake decorating to casual eating, there are many ways to enjoy our bulk candy pebbles."
    },
    "42690222457019": {
        "id": "42690222457019",
        "name": "Guittard Milk Chocolate A'Peels - 25lb",
        "prod_url": "https://www.candystore.com/products/guittard-milk-chocolate-apeels",
        "img_url": "https://www.candystore.com/cdn/shop/products/Guittard-Milk-Chocolate-A-Peels-25lb-CandyStore-com-385_2048x.jpg?v=1677142143",
        "price": 154.99,
        "desc": "Guittard Milk Chocolate A'Peels - 25lb"
    },
    "42689192427707": {
        "id": "42689192427707",
        "name": "Crushed Peppermint Candy - 15lb",
        "prod_url": "https://www.candystore.com/products/fine-crushed-peppermint",
        "img_url": "https://www.candystore.com/cdn/shop/products/Crushed-Peppermint-Candy-15lb-CandyStore-com-871_2048x.png?v=1677132399",
        "price": 114.99,
        "desc": "Crushed Peppermint candy pieces perfect for toppings and cocktails and decorating Christmas desserts and so much more. Crushed peppermint in bulk. "
    },
    "42690277933243": {
        "id": "42690277933243",
        "name": "Pink Donut Hole Bites Candy - 10lb Bulk",
        "prod_url": "https://www.candystore.com/products/donut-hole-bites",
        "img_url": "https://www.candystore.com/cdn/shop/products/donut-hole-bites-1q23-wmark_2048x.jpg?v=1677494067",
        "price": 74.99,
        "desc": "Donut Hole Bites - 10lb"
    },
    "42690179858619": {
        "id": "42690179858619",
        "name": "Peanut Butter Baking Chips - 10lb Bulk",
        "prod_url": "https://www.candystore.com/products/peanut-butter-chips",
        "img_url": "https://www.candystore.com/cdn/shop/products/Peanut-Butter-Chips-10lb-CandyStore-com-515_2048x.jpg?v=1677164129",
        "price": 46.99,
        "desc": "Peanut Butter Chips - 10lb"
    },
    "42688502268091": {
        "id": "42688502268091",
        "name": "Mini M&M's Milk Chocolate Baking - 12.5lb Bulk",
        "prod_url": "https://www.candystore.com/products/mms-mini-bulk",
        "img_url": "https://www.candystore.com/cdn/shop/products/Mini-M-M-s-Milk-Chocolate-Baking-12-5lb-Bulk-CandyStore-com-16_2048x.jpg?v=1677159909",
        "price": 125.99,
        "desc": "When you think of M&M minis, you probably envision the plastic tubes with a single helping of tasty chocolate pieces inside. Well now you can enjoy your favorite take on classic M&M's in any quantity you like. Our bulk miniature M&M's are guaranteed to please!Order as many packages as you like so you always have them available to add to school lunches or to enjoy as a quick snack while on the go! Mini M&M's are also perfect for birthdays, picnics, reunions and other parties. Just pour some in a candy dish and you have a presentable snack that everyone will love!Every irresistible disc includes a mouthwatering chocolate center surrounded by a colorful candy shell, just like the bigger version! Mini M&M's make delicious sundae toppings and can be used to decorate cakes, cookies, cupcakes or whatever creative dish you're preparing for dessert. Order today and get your favorite M&M's in bulk!"
    },
    "42688369983675": {
        "id": "42688369983675",
        "name": "Nonpareils Chocolates w Rainbow Seeds by Asher's - 8lb",
        "prod_url": "https://www.candystore.com/products/nonpareils-chocolates-sprinkles",
        "img_url": "https://www.candystore.com/cdn/shop/products/Nonpareils-Chocolates-8lb-CandyStore-com-87_2048x.jpg?v=1677161538",
        "price": 93.99,
        "desc": "Chocolate nonpareils offer a different take on this classic candy. While the pastel color and smooth, sweet taste of nonpareils mints is appealing, sometimes you need a flavor that's a little richer. Our chocolate version offers a savory sweetness that is absolutely irresistible!Every piece includes a playful swirl of chocolate which forms an eye-catching disc. The bottom is dipped in dot candies which add variety to the finished product. Nonpareils chocolates will really wow guests at any event. Pour into candy dishes and serve at birthdays, picnics, showers or other celebrations. You can tuck a few in a small gift bag or box to hand out to loved ones as wedding favors. They can even be used to add elegance to cakes, cupcakes, cookies and other baked goods. Simply add icing then decorate with chocolate nonpareils! We make it so easy to get all the pieces you need for any occasion. Order our bulk nonpareil chocolates today and share the amazing taste of the world's favorite confection!"
    },
    "42688411533499": {
        "id": "42688411533499",
        "name": "Heath Chunks Toffee Bits Medium Ground - 3lb",
        "prod_url": "https://www.candystore.com/products/heath-chunks-toffee-bits-chocolate-medium-ground-3lb",
        "img_url": "https://www.candystore.com/cdn/shop/products/Heath-Chunks-Toffee-Bits-Medium-Ground-3lb-CandyStore-com-855_2048x.jpg?v=1677144129",
        "price": 42.99,
        "desc": "Milk chocolate English toffee bits, medium ground. Are you hosting a sundae bar for a work or fellowship event, or getting a head start on your Christmas freezer cookies? Heath Chunks Toffee Bits raise the tone of your desserts with the classic crunch and perfect pairing of milk chocolate and English toffee. These bulk Heath Chunks Toffee Bits are perfect for topping brownies, but don't be surprised if you end up with fewer than your recipe calls for, they're irresistible to munch! The dark color of these wholesale milk-chocolate toffee bits gives a lovely, earthy contrast with whipped topping and looks great in a glass or ceramic bowl on your wedding reception's dessert bar. Small- to medium-sized Heath Chunks have a pebble-like texture that's gorgeous wherever you want a somewhat more natural look in your culinary presentation. They're great in milkshakes, too, but whatever the form, it's hard for most anyone to say no to Heath Chunks Toffee Bits!"
    },
    "42690288746683": {
        "id": "42690288746683",
        "name": "Nonpareils Candy Pennsylvania Dutch - 12ct Peg Bags",
        "prod_url": "https://www.candystore.com/products/clear-window-bag-nonpareils-peg-bags-35oz-pennsylvania-dutch",
        "img_url": "https://www.candystore.com/cdn/shop/products/clear-window-bag-nonpareils-peg-bags-35oz-pennsylvania-dutch-1q23-wmark_2048x.jpg?v=1677493908",
        "price": 38.99,
        "desc": "Clear Window Bag Nonpareils Peg Bags 3.5oz Pennsylvania Dutch - 12ct"
    },
    "42688417136827": {
        "id": "42688417136827",
        "name": "Mini Reeses Pieces Candy -12.5lb",
        "prod_url": "https://www.candystore.com/products/reeses-pieces-mini-peanut-butter-candy-toppings-bulk",
        "img_url": "https://www.candystore.com/cdn/shop/products/Mini-Reeses-Pieces-Candy-12-5lb-CandyStore-com-59_2048x.jpg?v=1677160066",
        "price": 114.99,
        "desc": "They may be small, but they have huge, peanut butter flavor! We're talking about the all-time favorite candy, Reese's Pieces. And these pint-sized, Mini Reese's Pieces are here to delight your taste buds. Use them as a great addition to Thanksgiving, Halloween, or a make your own sundae ice cream bar. Their beautiful yellow, brown, and yellow coloring makes them ideal for the fall and their peanut buttery taste has the richness the season craves. Inspired by their older and delicious sibling, Reese's Peanut Butter Cups that were created in 1928, these pieces were introduced by The Hershey Company in 1978."
    },
    "42688407666875": {
        "id": "42688407666875",
        "name": "Semi-Sweet Chocolate Chips 4000ct - 10b",
        "prod_url": "https://www.candystore.com/products/semi-sweet-chocolate-chips-small-bulk",
        "img_url": "https://www.candystore.com/cdn/shop/products/Semi-Sweet-Chocolate-Chips-4000ct-10b-CandyStore-com-451_2048x.jpg?v=1677173709",
        "price": 66.99,
        "desc": "Aww, you're so sweet. Sorry, we're talking to our Semi Sweet Chocolate Chips here and think you'll fall in love with them too the moment you take a bite. Ideal for adding to your favorite baked goods recipes, decorating cakes and cupcakes, adding to the top of sundaes, throwing into trail mix, or just snacking on my the handful, this bulk bag of these tiny chocolate morsels will help you do it all and more. Get yourself some and throw an amazing fondue party for friends. Melt them and make your own chocolate covered pretzels. The choice is yours in how you enjoy thousands of these tasty chocolate chips."
    },
    "44507168473275": {
        "id": "44507168473275",
        "name": "Bulk Chocolate Nonpareils w Seeds Rainbow & White - 6lb",
        "prod_url": "https://www.candystore.com/products/chocolate-nonpareils-bulk",
        "img_url": "https://www.candystore.com/cdn/shop/products/Bulk-Chocolate-Nonpareils-w-Seeds-Rainbow-White-6lb-CandyStore-com-67_2048x.jpg?v=1677666944",
        "price": 90.99,
        "desc": ""
    },
    "42689656127675": {
        "id": "42689656127675",
        "name": "Chocolate Toffee Fine Buttercrunch Candy - 6lb",
        "prod_url": "https://www.candystore.com/products/fine-buttercrunch",
        "img_url": "https://www.candystore.com/cdn/shop/products/Fine-Buttercrunch-6lb-CandyStore-com-137_2048x.jpg?v=1677135827",
        "price": 109.99,
        "desc": "Fine Buttercrunch - 6lb"
    }
}