{
    "42688384532667": {
        "id": "42688384532667",
        "name": "Wax Lips Cherry Wack-O-Wax Candy - 24ct",
        "prod_url": "https://www.candystore.com/products/wax-lips",
        "img_url": "https://www.candystore.com/cdn/shop/products/Wax-Lips-Cherry-Wack-O-Wax-Candy-24ct-CandyStore-com-694_2048x.jpg?v=1677185071",
        "price": 52.99,
        "desc": "Wacko-Wax Wax Lips are a classic and hilarious treat that dates back to the early 20th century. These fun lips are made from edible flavored wax, and designed to be chewed like gum; once the play and jokes have ended. These Wax Lips will make a great addition to your next party. Use them as photo props, or for gags at a 5th birthday party. Princess parties and birthdays will be cleaner and funnier when the little royalty uses these lips instead of lipstick. These lips are perfect for Valentine's Day; Wacko-Wax lips make great Valentines for classrooms, senior living, and companies. Wax Lips are easy and safe to use for all ages, inside each set of Wax Lips has an easy bite plate that will not deteriorate. Each box of Wacko-Wax Wax Lips comes individually wrapped lips."
    },
    "42688745472187": {
        "id": "42688745472187",
        "name": "Wax Bottles Candy Nik-L-Nip - 18lb Bulk",
        "prod_url": "https://www.candystore.com/products/concord-nik-l-nip-wax-bottles-candy",
        "img_url": "https://www.candystore.com/cdn/shop/products/Wax-Bottles-Candy-Nik-L-Nip-18lb-Bulk-CandyStore-com-248_2048x.jpg?v=1677185083",
        "price": 104.99,
        "desc": "It's okay to hit the bottle when it comes to this Concord Nik-L-Nip Wax Bottles Candy. By using wax in the form of bottles and delicious sweet and colorful liquid inside, you can bite off the top and drink the center or chew the whole thing up at once. It's up to you!Make your family smile when you bring home this classic Concord Nik-L-Nip Wax Bottles Candy. You can add some to individual size baggies for party favors, stuff a few into lunch boxes, use some on New Year's Eve as a thematic and tasty treat or even celebrate a wedding with some of these in tow. Order some Concord Nik-L-Nip Wax Bottles Candy today and you'll be sure to find a ton of delicious ways to enjoy it!"
    },
    "42688746094779": {
        "id": "42688746094779",
        "name": "Mr. Stache Wack-O-Wax Wax Mustaches - 24ct",
        "prod_url": "https://www.candystore.com/products/wack-o-wax-mr-stache",
        "img_url": "https://www.candystore.com/cdn/shop/products/Mr-Stache-Wack-O-Wax-Wax-Mustaches-24ct-CandyStore-com-619_2048x.jpg?v=1677160348",
        "price": 51.99,
        "desc": "Chewable, funny and totally wacky, these Wack-O-Wax Mr. Stache candies are the life of the party when it comes to treats. We mustache you a question, but we'll shave it for later. If you loved that joke, then you'll love playing with these Wack-O-Wax Mr. Stache candies! Lighten the mood at any event or break the ice by giving out some of these Wack-O-Wax Mr. Stache candies. Every guest will laugh while they hold them up to their face and will enjoy chewing on them once they're through. Stuff some Wack-O-Wax Mr. Stache candies into a pinata for a fun surprise or even use some in a trick-or-treating Halloween bowl to delight kids in costumes."
    },
    "42688746029243": {
        "id": "42688746029243",
        "name": "Nik L Nip Wax Bottles 5pk - 18ct",
        "prod_url": "https://www.candystore.com/products/nik-l-nip-wax-bottles",
        "img_url": "https://www.candystore.com/cdn/shop/products/Nik-L-Nip-Wax-Bottles-5pk-18ct-CandyStore-com-826_2048x.jpg?v=1677161363",
        "price": 43.99,
        "desc": "Green, yellow, red, orange and blue await you! We're talking about our Nik L Nip Wax Bottles 5pk and the delicious candy liquid that's inside. Bite down on the bottle-shaped wax and flood your mouth with delicious fruity flavor. These Nik L Nip Wax Bottles 5pk make a great choice for Halloween candy or goody bag stuffers for little kid birthday parties. You can even put them into piñatas or set them out on the refreshments table at a party for everyone to drink down as they please. Because these Nik L Nip Wax Bottles 5pk come in a lovely rainbow of colors and are full of delicious flavor, they're ready for practically any event you can think of!"
    },
    "42688759529659": {
        "id": "42688759529659",
        "name": "Nik L Nips Mini Drinks Wax Bottles 8-Packs -12ct",
        "prod_url": "https://www.candystore.com/products/nik-l-nips-bottle-10pk",
        "img_url": "https://www.candystore.com/cdn/shop/products/nik-l-nips-bottle-10pk-1q23-wmark_2048x.jpg?v=1677608321",
        "price": 39.99,
        "desc": "Nik L Nips bottle candy are a classic treat with a unique design. Kids will love the novelty of \"eating\" their drink. Each package contains an assortment of colorful Nik L Nips bottles. Instead of glass, each miniature bottle is made using a chewy transparent wax. A single serving of tasty syrup is waiting inside. Bite off the cap (or any side you like), drink the liquid, then chew the bottle like bubblegum!"
    },
    "42690294120635": {
        "id": "42690294120635",
        "name": "Nik-N-Nip Wax Bottles Candy - 12ct Peg Bags",
        "prod_url": "https://www.candystore.com/products/wax-bottles-clear-window-peg-bags-3oz",
        "img_url": "https://www.candystore.com/cdn/shop/products/wax-bottles-clear-window-peg-bags-3oz-1q23-wmark_2048x.jpg?v=1677495879",
        "price": 38.99,
        "desc": "Wax Bottles Clear Window Peg Bags 3oz - 12ct"
    },
    "42688384499899": {
        "id": "42688384499899",
        "name": "Wax Fangs - 24ct",
        "prod_url": "https://www.candystore.com/products/wax-fangs",
        "img_url": "https://www.candystore.com/cdn/shop/products/Wax-Fangs-24ct-CandyStore-com-165_2048x.jpg?v=1677185065",
        "price": 89.99,
        "desc": "They vant to suck your blood. Sorry, we can't help but go a little Transylvanian whenever we lay our eyes on these fanged candies. That's because our Wax Fangs are so fun and funny that we can't resist slipping into vampire mode. Get ready for the Halloween season by ordering a bulk supply of these Wax Fangs. They make a funny trick to give out to little trick-or-treaters and a fun party favor for Halloween events. Have everyone pop these Wax Fangs into their mouths for a hilarious photo op with a delicious and chewy finish."
    }
}